{
    "1": { "title": "What is 3D printing?", "content": "3D printing is an additive technology used to manufacture parts. It is ‘additive’ in that it doesn’t require a block of material or a mold to manufacture physical objects, it simply stacks and fuses layers of material. It’s typically fast, with low fixed setup costs, and can create more complex geometries than ‘traditional’ technologies, with an ever-expanding list of materials. It is used extensively in the engineering industry, particularly for prototyping and creating lightweight geometries.<br><br>‘3D printing’ is commonly associated with maker culture, hobbyists and amateurs, desktop printers, accessible printing technologies like FDM and low-cost materials such as ABS and PLA (we’ll explain all those acronyms below). This is largely attributable to the democratization of 3D printing through affordable desktop machines that sprung from the RepRap movement, like the original MakerBot and Ultimaker, which also led to the explosion of 3D printing in 2009.<br><br>By contrast, additive manufacturing (AM) is almost always associated with commercial and industrial applications.<br><br>‘Rapid prototyping’ is another phrase that’s sometimes used to refer to 3D printing technologies. This dates back to the early history of 3D printing when the technology first emerged. In the 1980s, when 3D printing techniques were first invented, they were referred to as rapid prototyping technologies because back then the technology was only suitable for prototypes, not production parts.<br><br>In recent years, 3D printing has matured into an excellent solution for many kinds of production parts, and other manufacturing technologies (like CNC machining) have become cheaper and more accessible for prototyping. So while some people still use ‘rapid prototyping’ to refer to 3D printing, the phrase is evolving to refer to all forms of very fast prototyping." },
    "2": { "title": "What is FDM (fused deposition modeling) 3D printing?", "content": "Fused deposition modeling (FDM) 3D printing, also known as fused filament fabrication (FFF), is an additive manufacturing (AM) process within the realm of material extrusion. FDM builds parts layer by layer by selectively depositing melted material in a predetermined path. It uses thermoplastic polymers that come in filaments to form the final physical objects.</p><p>Composing the largest installed base of 3D printers worldwide, FDM is the most widely used technology across most industries, and likely the first process you think of when 3D printing comes up.</p><img src='/images/FDM_functional.jfif'><p>In this article, we cover the basic principles and key characteristics of this popular additive technology. We also explore the differences between FDM machines built for prototyping (desktop) and industrial applications and provide tips and tricks for engineers to get the best results from FDM 3D printing.</p><h2>How does FDM 3D printing work?</h2><p>An FDM 3D printer works by depositing melted filament material over a build platform layer by layer until you have a completed part. FDM uses digital design files that are uploaded to the machine itself and translates them into physical dimensions. Materials for FDM include polymers such as ABS, PLA, PETG and PEI, which the machine feeds as threads through a heated nozzle.</p><p>To operate an FDM machine, you first load a spool of this thermoplastic filament into the printer. Once the nozzle hits the desired temperature, the printer feeds the filament through an extrusion head and nozzle.</p><p>This extrusion head is attached to a three-axis system that allows it to move across the X, Y and Z axes. The printer extrudes melted material in thin strands and deposits them layer by layer along a path determined by the design. Once deposited, the material cools and solidifies. You can attach fans to the extrusion head to accelerate cooling in some cases.</p><p>To fill an area, multiple passes are required, similar to coloring in a shape with a marker. When the printer finishes a layer, the build platform descends and the machine begins work on the next layer. In some machine setups, the extrusion head moves up. This process repeats until the part is finished.</p><h2>What are the print parameters for FDM 3D printers?</h2><p>Most FDM systems allow you to adjust several process parameters. These include the nozzle and build platform temperatures, build speed, layer height and cooling fan speed. If you’re a designer, you normally don’t have to worry about these adjustments, as an AM operator probably already has that covered.</p><p>Factors that are important to consider, though, are build size and layer height. The common build size of a desktop 3D printer is 200 x 200 x 200 mm, while industrial machines can reach sizes of 1,000 x 1,000 x 1,000 mm. If you prefer to use a desktop machine to print your part, you can break down a big model into smaller parts and then reassemble it. </p><p>FDM’s typical layer height measures between 50 and 400 microns. Printing shorter layers produces smoother parts and more accurately captures curved geometries, though printing taller layers lets you create parts quicker and for a lower price tag. </p><h2>What are the characteristics of FDM 3D printing?</h2><p>While FDM 3D printers vary in terms of their extrusion systems and the part quality you get from various machines, there are common characteristics that you can expect from every FDM printing process.</p><p>Warping is one of the most common defects in FDM. When extruded material cools during solidification, its dimensions decrease. Since different sections of the printed part cool at different rates, their dimensions also change at different speeds. Differential cooling causes the buildup of internal stresses that pull the underlying layer upward, causing it to warp.</p><p>There are several ways to prevent warping. One method is to closely monitor the temperature of your FDM system, especially the build platform and chamber. You can also increase the adhesion between the part and the build platform to mitigate warping.</p><p>Making certain choices during the design process can also reduce the likelihood of your part warping. Here are a few examples:</p><p>1. Large, flat areas - like you’d see on a rectangular box - are more prone to warping. Try to avoid these whenever possible. </p><p>2. Thin protruding features - think of the prongs on a fork - are also prone to warping. Adding extra guiding or stress-relieving material at the edges of thin features to increase the area that makes contact with the build platform helps to avoid this. </p><p>3. Sharp corners warp more often than rounded shapes, so we recommend adding fillets to the design. </p><p>4. Every material has its own susceptibility to warping. For instance, ABS is generally more sensitive to warping than PLA or PETG, for instance.</p><p>Secure adhesion between deposited layers of a part is critical in FDM. When an FDM machine extrudes molten thermoplastic through the nozzle, this material presses against the previously printed layer. High temperature and pressure cause this layer to re-melt and enable it to bond with the previous layer. </p><p>And since the molten material presses against the previously printed layer, its shape deforms to an oval. This means that FDM parts always have a wavy surface, no matter what layer height is used, and that small features, such as small holes or threads, may require post-processing.</p><p>To reduce print time and save on materials, FDM printers usually don’t produce solid parts. Instead, the machine traces the outer perimeter - called the shell - over several passes, and fills the interior - called the infill - with an internal, low-density structure. </p><p>Infill and shell thickness significantly affect the strength of FDM-printed parts. Most desktop FDM printers have a 20% infill density default setting and 1 mm shell thickness, which provides a suitable compromise between strength and speed for quick prints.</p><h2>What are common materials for FDM 3D printing?</h2><p>One of the key advantages of FDM (both desktop and industrial) is the technology’s wide range of materials. This includes commodity thermoplastics such as PLA and ABS, engineering materials like PA, TPU and PETG, and high-performance thermoplastics, including PEEK and PEI. </p><p>PLA filament is the most common material used in desktop FDM printers. Printing with PLA is relatively easy and can produce parts with finer details. When you need higher strength, ductility and thermal stability, you normally use ABS. However, ABS is more prone to warping, especially if you are using a machine that doesn’t have a heated chamber. </p><p>Another alternative for desktop FDM printing is PETG, which is comparable to ABS in its composition and how easy it is to print with. All three of these materials are suitable for most 3D printing service applications, from prototyping to form, fit and function, to low-volume production of models or functional parts. </p><p>Industrial FDM machines, on the other hand, mainly use engineering thermoplastics, including ABS, polycarbonate (PC) and Ultem. These materials usually come with additives that alter their properties and make them particularly useful for industrial needs like high impact strength, thermal stability, chemical resistance and biocompatibility.</p><img src='/images/FDM_material.jfif'><h2>Post-processing for FDM 3D printing</h2><p>FDM 3D printed parts can be finished to quite a high standard via several post-processing methods, including sanding and polishing, priming and painting, cold welding, vapor smoothing, epoxy coating and metal plating.  " },
    "3": { "title": "What is SLA printing? The original resin 3D print method", "content": "SLA, or stereolithography, is a widely-used 3D printing process and the most popular of the resin printing technologies. The process owes its esteem in the additive space to its ability to produce prototypes that are accurate, isotropic and watertight, as well as production parts with impressive surface smoothness and more detailed features.</p><p>Despite its host of advantages, though, it's tricky to know whether SLA will yield the best results for your specific parts. In this introduction to SLA, we cover the basic principles of the process to determine whether it's suitable for your application.</p><h2>What is SLA (stereolithography)?</h2><img src = '/images/whatIsSLA.jfif'><br><p>Stereolithography (SLA) is an additive manufacturing process that belongs to the vat photopolymerization family. Also known as resin 3D printing, there are three main 3D printing technologies associated with vat polymerization: SLA, DLP and LCD. The three technologies all use a light source to cure a photopolymer resin but with the following differences:</p><p>1. Stereolithography (SLA) uses UV lasers as a light source to selectively cure a polymer resin.</p><p>2. Digital light processing (DLP) uses a digital projector as a UV light source to cure a layer of resin.</p><p>3. Liquid crystal display (LCD) uses an LCD display module for projecting specific light patterns.</p><p>SLA is one of the most widely used vat photopolymerization technologies. It creates objects by selectively curing a polymer resin, layer by layer, using an ultraviolet (UV) laser beam. The materials used in SLA are photosensitive thermoset polymers that come in a liquid form.</p><p>Patented in 1986, SLA was the first 3D printing technology. And even today, SLA is still the most cost-effective 3D printing technology available when parts of very high accuracy or smooth surface finish are needed. The best results come when a designer takes advantage of the benefits and limitations of the manufacturing process.</p><h2>How does SLA 3D printing work?</h2><p>1. SLA 3D printing works by first positioning the build platform in the tank of liquid photopolymer, at a distance of one layer height for the surface of the liquid.</p><p>2. A UV laser creates the next layer by selectively curing and solidifying the photopolymer resin.</p><p>3. During the solidification part of the photopolymerization process, the monomer carbon chains that compose the liquid resin are activated by the light of the UV laser and become solid, creating strong unbreakable bonds between each other.</p><p>4. The laser beam is focused in a predetermined path using a set of mirrors, called galvos. The whole cross-sectional area of the model is scanned, so the produced part is fully solid.</p><p>5. After printing, the part is in a not-fully-cured state. It requires further post-processing under UV light if very high mechanical and thermal properties are required.</p><p>The photopolymerization process is irreversible and there is no way to convert the SLA parts back to their liquid form. Heating these SLA parts will cause them to burn instead of melt. This is because the materials that are produced with SLA are made of thermoset polymers, as opposed to the thermoplastics that fused deposition modeling (FDM) uses.</p><h2>What are the print parameters of SLA?</h2><p>Most print parameters in SLA systems are fixed by the manufacturer and cannot be changed. The only inputs are the layer height and part orientation (the latter determines support location).</p><p>Layer height: Ranges between 25 and 100 microns. Lower layer heights capture curved geometries more accurately but increase the build time and cost—and the probability of a failed print. A layer height of 100 microns is suitable for most common applications.</p><p>Build size: This is another parameter that is important for the designer. The build size depends on the type of SLA machine. There are two main SLA machine setups: the top-down orientation and the bottom-up orientation: </p><p>1. Top-down printers place the laser source above the tank and the part is built facing upwards. The build platform begins at the very top of the resin vat and moves downwards after every layer.</p><p>2. Bottom-up printers place the light source under the resin tank (see figure above) and the part is built upside down. The tank has a transparent bottom with a silicone coating that allows the light of the laser to pass through but stops the cured resin from sticking to it. After every layer, the cured resin is detached from the bottom of the tank, as the build platform moves upwards. This is called the peeling step. </p><p>The bottom-up orientation is mainly used in desktop printers, like Formlabs, while the top-down is generally used in industrial SLA systems. Bottom-up SLA printers are easier to manufacture and operate, but their build size is limited. This is because the forces applied to the part during the peeling step might cause the print to fail. On the other hand, top-down printers can scale up to very large build sizes without a big loss in accuracy. The advanced capabilities of these systems come at a higher cost.</p><h2>What are the characteristics of SLA 3D printing?</h2><p>The main characteristics of SLA 3D printing are the necessary support structure, curling and layer adhesion.</p><h2>Support structures</h2><p>A support structure is always required in SLA. Support structures are printed in the same material as the part and must be manually removed after printing. The orientation of the part determines the location and amount of support. It is recommended that the part is oriented so that so visually critical surfaces do not come in contact with the support structures.</p><p>Bottom-up and top-down SLA printers use support differently:</p><p>1. Top-down SLA printers: Support requirements are similar to those for FDM. They are needed to accurately print overhangs and bridges (the critical overhang angle is usually 30o). The part can be oriented in any position, and they are usually printed flat, to minimize the amount of support and the total number of layers.</p><p>2. Bottom-up SLA printers: Support requirements can be more complex. Overhangs and bridges must still be supported, but minimizing the cross-sectional area of each layer is the most crucial criterion: the forces applied to the part during the peeling step may cause it to detach from the build platform. These forces are proportional to the cross-sectional area of each layer. For this reason, parts are oriented at an angle and the reduction of support is not a primary concern.</p><h2>Curling</h2><p>One of the biggest problems relating to the accuracy of parts produced via SLA is curling. Curling is similar to warping in FDM.</p><p>During the curing process, the resin shrinks slightly upon exposure to the printer's light source. When the shrinkage is considerable, large internal stresses develop between the new layer and the previously solidified material, which results in the part curling. </p><p>Support is important to help anchor at-risk sections of a print to the build plate and mitigate the likelihood of curling. Part orientation and limiting large flat layers are also important. Over-curing (for example by exposing the part to direct sunlight post-printing) might also cause curling.</p><p>The best way to prevent curling is to keep it in mind during the design process. Avoid large thin and flat areas wherever possible, or add a structure to prevent the part from curling.</p><h2>Layer adhesion</h2><p>SLA-printed parts have isotropic mechanical properties. This is because a single UV laser pass is not enough to fully cure the liquid resin. Later laser passes help previously solidified layers to fuse together to a very high degree. In fact, curing continues even after the completion of the printing process. </p><p>To achieve the best mechanical properties, SLA parts must be post-cured, by placing them in a cure box under intense UV light (and sometimes at elevated temperatures). This greatly improves the hardness and temperature resistance of the SLA part but makes it more brittle. The results of the post-curing process mean:</p><p>1. Test pieces of parts printed in standard clear resin using a desktop SLA printer have almost twice as much tensile strength post-cure (65 MPa compared to 38 MPa).</p><p>2. Parts can operate under load at higher temperatures (at a max temperature of 58ºC compared to 42ºC). </p><p>3. The elongation at break is almost half (6.2% compared to 12%).</p><p>Leaving the SLA printed part in the sun can also cause curing. Although spray coating with a clear UV acrylic paint before use is highly recommended because extended exposure to UV light has a detrimental effect in the physical properties and appearance of SLA parts—they may curl, become brittle or change color.</p><h2>Accuracy of SLA printing</h2><p>SLA is one of the most accurate forms of 3D printing. It can achieve layer resolutions of 25 microns or less, and layer thicknesses as low as 10 microns. Generally, industrial SLA printers are more accurate than desktop machines, with typical dimensional accuracy of ± 0.2%, with a lower limit of ± 0.13 mm (± 0.005).</p><p>SLA’s precision enables it to create parts with very tight tolerances, as well as those with intricate details and complex geometries. However, the accuracy of SLA printing depends on several factors, including the following.</p><p>1. Layer thickness. The thinner your print’s layers, the finer the details of your part can be, contributing to higher accuracy.</p><p>2. Laser spot size. The diameter of the printer’s laser beam determines the minimum feature size and affects your printer’s precision.</p><p>3. Material properties. Resin characteristics like viscosity and pigmentation can impact part's dimensional accuracy and surface finish. Resins with low viscosity and high levels of pigmentation usually result in more accurate prints.</p><p>4. Printing orientation. Parts printed at different orientations may exhibit variations in accuracy due to factors like support structures and resin flow dynamics.</p><h2>Surface finish</h2><p>SLA 3D printing can achieve very smooth surface finishes, and is a great choice for creating visual prototypes. This is because the printing process involves curing liquid resin layer by layer with a UV laser, resulting in minimal visible layer lines.</p><p>Choosing an SLA resin with low viscosity can further enhance your part’s surface finish. So can post-processing techniques like sanding, polishing, or chemical smoothing. In all, this can result in parts with glossy surface finishes that rival parts created with injection molding.</p><h2>What materials are used for SLA printing?</h2><p>SLA materials come in the form of liquid resins, which can be chosen based on the end use of the part—for example, thermal resistance properties, a smooth surface finish or abrasion resistance. As such, the price of the resin varies greatly, from about $50 per liter for the standard material, upwards to $400 per liter for specialty materials, such as castable or dental resin. Industrial systems offer a wider range of materials than desktop SLA printers, which gives the designer closer control over the mechanical properties of the printed part.</p><p>SLA materials (thermosets) are more brittle than the materials produced with FDM or SLS (thermoplastics) and for this reason, SLA parts are not usually used for functional prototypes that will undertake significant loading. Advances in materials may change this in the near future.</p><h2>What are the options for SLA post-processing?</h2><p>SLA parts can be finished to a very high standard using various post-processing methods, such as sanding and polishing, spray coating and finishing with mineral oil.</p>" },
    "4": { "title": "What is SLS 3D printing?", "content": "Selective Laser Sintering (SLS) is an additive manufacturing process that belongs to the powder bed fusion family. In SLS 3D printing, a laser selectively sinters the particles of a polymer powder, fusing them together and building a part, layer by layer. The materials used in SLS are thermoplastic polymers that come in a granular form.</p><p>Overall, SLS is a versatile solution, especially if you want to hold off on injection molding and its exorbitant startup costs. It's definitely more cost-efficient for producing high-quality components in reasonable amounts (fewer than 1,000 units) to test how well your product or technology fares before making expensive molds and tools.</p><p>Our SLS 3D printing service is used for both prototyping with functional polymer components and for small to medium production runs or end-use parts. </p><img src ='/images/SLS_01.jpg'><h2>How does SLS 3D printing work?</h2><p>SLS 3D printing uses a laser to sinter small particles of polymer powder. The entire cross-section of the component is scanned, so the part is built solid. The process works as follows:</p><p>1. The powder bin and the build area are first heated to just below the melting temperature of the polymer.</p><p>2. A re-coating blade spreads a thin layer of powder over the build platform.</p><p>3. A CO2 laser then scans the contour of the next layer and selectively sinters—fuses together—the particles of the polymer powder. </p><p>4. When a layer is complete, the build platform moves downwards and the blade re-coats the surface. The process then repeats until the whole part is complete.</p><p>5. After printing, the parts are fully encapsulated in unsintered powder. The powder bin must cool before the parts can be unpacked, which can take a considerable amount of time—sometimes up to 12 hours.</p><p>6. The parts are then cleaned with compressed air or another blasting media, then they are ready to use or further post-process. </p><h2>Can you use SLS 3D printing for rapid prototyping?</h2><p>SLS is a great solution for the rapid prototyping of functional polymers because it offers a very high degree of design freedom and high accuracy. And unlike FDM or SLA 3D printing techniques, it produces parts with consistent mechanical properties. This means it can be leveraged to produce parts that are very close to end-use part quality, so you can rely on the technology for concept to trial models. </p><h2>Can you use SLS 3D printing for low-production runs?</h2><p>Its versatility makes SLS 3D printing an ideal alternative to injection molding for low-production runs. SLS can be used to manufacture parts with complex shapes and geometries, and with a wide variety of finishes and lead times.</p><h2>How does an SLS 3D printer work? </h2><img src='/images/SLS_printer.jpg'><p>For use of an SLS 3D printer, almost all process parameters are preset by the machine manufacturer. The default layer height used is 100–120 microns. </p><p>A key advantage of SLS 3D printing is that it needs no support structures. The unsintered powder provides the part with all the necessary support. For this reason, SLS can be used to create free-form geometries that are impossible to manufacture with any other method.</p><p>Taking advantage of the whole build volume is very important when printing with SLS, especially for small-batch production orders. This is because laser scanning occurs very rapidly, so it’s actually the re-coating step that determines the total processing time. The machine will have to cycle through the same number of layers regardless of the number of parts. Bin packing may affect lead times of small orders, as operators may wait until a bin is filled before starting a print task.</p><h2>Layer Adhesion</h2><p>The bond strength between layers in SLS 3D printing is excellent. This means that SLS-printed parts have almost isotropic mechanical properties.</p><h2>Shrinkage & Warping</h2><p>SLS parts are susceptible to shrinkage and warping. As the newly sintered layer cools, its dimensions decrease and internal stresses build up, pulling the underlying layer upwards.</p><p>It's important to note that 3 to 3.5% shrinkage is typical in SLS, but machine operators take this into account during the build preparation phase and adjust the size of the design accordingly.</p><p>Large flat surfaces are the most likely to warp. The issue can be mitigated somewhat by orientating the part vertically in the build platform, but the best practice is to reduce its volume by minimizing the thickness of the flat areas and by introducing cutouts to the design. This strategy will also reduce the overall cost of the part, as less material is used. </p><h2>Oversintering</h2><p>Oversintering occurs when radiant heat fuses unsintered powder around a feature. This can result in a loss of detail in small features, such as slots and holes. As a rule of thumb, slots wider than 0.8mm and holes with diameters larger than 2mm can be printed in SLS without fear of oversintering. </p><h2>Powder removal</h2><pSince SLS requires no support material, parts with hollow sections can be printed easily and accurately. </p><p>Hollow sections reduce the weight and cost of a part, as less material is used. Escape holes are needed to remove the unsintered powder from the inner sections of the component. We recommend adding at least two escape holes to your design, with a minimum diameter of 5mm.</p><p>If a high degree of stiffness is required, parts must be printed fully solid. An alternative is to make a hollow design omitting the escape holes. In this way, any tightly packed powder will be trapped in the part, increasing its mass and providing some additional support against mechanical loads, without an effect on the build time.</p><p>An internal honeycomb lattice structure can be added to the hollowed interior (similar to the infill patterns used in FDM) to further increase the stiffness of the component. Hollowing a part this way may also reduce warping.</p><h2>What materials are used for SLS printing?</h2><p>The most widely used SLS material is Polyamide 12 (PA 12), also known as Nylon 12. The price per kilogram of PA 12 powder is around $50–$60. Other engineering plastics such as PA 11 and PEEKare also available, but these are not as widely used.</p><p>Polyamide powder can be filled with various additives to improve the mechanical and thermal behavior of the produced SLS part. Examples of additives include carbon fibers, glass fibers or aluminum. Materials filled with additives are usually more brittle and can have highly anisotropic behavior.</p><h2>What are the options for SLS post-processing?</h2><p>SLS 3D printing produces parts with a powdery, grainy surface finish that can be easily stained. The appearance of SLS printed parts can be improved to a very high standard using various post-processing methods, such as media polishing, dyeing, spray painting and lacquering. Their functionality can also be enhanced by applying a watertight coating or metal plating. </p>" },
    "5": { "title": "3D printing with PLA vs. ABS: What's the difference?", "content": "<h2>PLA and ABS are two essential materials for 3D printing with FDM. They are also two of the most popular materials on our platform. This comparison will help you choose which material to use for your 3D-printed custom parts.</h2><p>PLA and ABS are the two most common materials for prototyping (desktop) FDM 3D printing (aside from, perhaps, PETG). As thermoplastics, both filaments enter a soft and moldable state when heated, returning to a solid-state when cooled. FDM printers melt and extrude PLA and ABS filament through a nozzle to build up parts layer by layer.</p><p>While both materials are used for FDM, they have key differences that make each more optimal for different applications. In this article, we’ll cover the main differences between these commonly used materials.</p><h2>What is PLA? Printing with polylactic acid</h2><p>PLA (Polylactic Acid) is a thermoplastic derived from renewable sources such as cornstarch or sugarcane. Biodegradable under the right conditions, PLA is one of the most popular bioplastics and is perfect for a variety of applications ranging from plastic cups to medical implants.</p><p>Compared to many other 3D printing materials, PLA is quite cost-efficient, providing good value for money in exchange for high-quality components with relatively smooth surface finishes. PLA is easy to print with and has a higher stiffness than ABS and other materials like nylon, though it doesn't handle high temperatures or significant stress so well. While PLA is stronger than ABS and nylon, it’s not very heat or chemical-resistant. </p><h2>What is ABS? Printing with Acrylonitrile Butadiene Styrene</h2><p>ABS (Acrylonitrile Butadiene Styrene) is another common thermoplastic. It's a common fixture in 3D printing and quite popular in the world of injection molding. Real-world applications of ABS include toys (think LEGO bricks), housings for electronics, automotive parts, household appliances and much more.</p><p>Tough and resistant to impact to a certain point, ABS has superior mechanical properties to PLA while being lighter and more durable. However, the tradeoff is that it's harder to print with and often requires higher temperatures for effective printing. The material can deflect heat more effectively than PLA, but it's absolutely not known for total heat resistance. And for 3D printer operators, be aware that ABS can produce strong odors during the manufacturing process.</p><h2>What is the part accuracy of PLA and ABS?</h2><p>In general, the tolerances and accuracy of FDM printed components depend on printer calibration and model complexity. However, you can use PLA and ABS to create dimensionally accurate parts with printing details of 0.8 mm and minimum features of 1.2 mm. For connecting or interlocking parts, we recommend a tolerance of 0.5 mm and a minimum wall thickness of 1-2 mm. This will ensure that your part has adequate strength across all wall elements. </p><p>Thanks to its lower printing temperature, PLA is easier to print with and less likely to warp (when properly cooled). You can use PLA to print sharper corners and finer features than with ABS.</p><h2>How strong are PLA and ABS parts?</h2><p>PLA and ABS have similar tensile strengths, making them solid options for many prototyping applications. Designers and engineers often prefer ABS due to its improved ductility over PLA. ABS has higher flexural strength and better elongation before breaking than PLA, which means that ABS can also be used for end-use applications. PLA, on the other hand, is more popular for rapid prototyping when the form is more critical than the function.</p><p>Overall, PLA is a good option for your custom parts if you don’t plan on putting them under a lot of physical stress (or UV radiation and high temperatures). ABS is more fitting for industrial applications and can weather physical strain better than PLA.</p><h2>How fast can you print with PLA and ABS?</h2><p>Both PLA and ABS print at nearly identical speeds. This means that you don’t have to change speed settings on your FDM machines when switching between materials. For PLA, printing at 60 mm/s is pretty standard, though some operators have printed at over 150 mm/s, so the standard speed is by no means a limit. You can also print ABS at the same speed, but between 40-60 mm/s is a bit more accurate for this material.</p><h2>Surface finishes and post-processing for PLA and ABS</h2><p>Whether you produce parts using PLA or ABS, FDM-printed components will always have visible layers. Using PLA often results in a glossier finish, while ABS typically prints in a matte finish. To smooth an ABS-printed part and give it a glossy finish, you can use acetone in post-processing. Sanding and additional machining are viable post-processing options for parts printed in ABS. You can also sand and machine PLA, though greater care is required. </p><p>If aesthetic quality is critical, then we recommend using SLA 3D printing to produce your custom parts. </p><h2>How heat resistant are PLA and ABS?</h2><p>For applications requiring higher temperatures, ABS (glass transition temperature of 105°C) is preferable over PLA (glass transition temperature of 60°C). PLA can rapidly lose its structural integrity and can begin to droop and deform as it approaches 60°C, especially if it's supporting a heavier load. </p><h2>Are PLA and ABS biodegradable?</h2><p>PLA is stable in general atmospheric conditions, though it will biodegrade within 50 days in industrial composters and 48 months in water. While ABS is not biodegradable, you can recycle it. This being the case, manufacturers tend to use PLA to produce items related to food service, though we absolutely recommend you get safety confirmation from filament manufacturers. </p>" },
    "6": { "title": "FDM 3D printing materials compared", "content": "<h2>What’s the ideal material to use when 3D printing parts with FDM? This article compares the most common FDM 3D printing filaments, including PLA, ABS, PET, Nylon, TPU (Flexible) and PC, by their material properties to help you find the best option for your application.</h2><p>The 3D printing market sees a regular emergence of new materials, which can make choosing the ideal materials for your parts a challenge.</p><p>In the case of FDM (fused deposition modeling) 3D printing, PLA and ABS have historically been the two main polymers that manufacturers turn to, though there is now a wide range of materials available. Many of these are playing critical roles in the future of FDM.</p><p>We continuously see new products become more popular, including both pure polymers and composites. In this article, we focus on the main pure plastics that exist in the market today, including PLA, ABS, PET, Nylon, TPU (Flexible) and PC. Material suppliers often provide blends or additives for modifying the properties of pure polymers, though these are not covered here.</p><p>Choosing the right polymer is essential for getting the right properties for a 3D printed part, especially if your part will be functional. Let’s break down the pure polymers we offer at Protolabs Network.</p><h2>How do we grade FDM 3D printing filament materials?</h2><p>Materials are usually graded along 3 categories: mechanical performance, visual quality, and process. In this case, we further break down these categories to paint a clearer picture of the polymer’s properties. The choice of material really depends on what the user wants to print, so we listed the key decision criteria needed to choose a material (other than cost and speed):</p><p>1. Ease of printing: This is how easy it is to print in a material, with factors including bed adhesion, max printing speed, frequency of failed parts, flow accuracy and ease of feeding into the printer.</p><p>2. Max stress: The maximum stress an object can withstand when slowly pulling on it.</p><p>3. Elongation at break: The ratio between the initial length and the changed length after an object breaks. It’s also called fracture strain.</p><p>4. Impact resistance: The energy required to break an object with a sudden impact.</p><p>5. Layer adhesion (isotropy): This is how well the layers of material adhere to one another. It’s linked to isotropy (uniformity in all directions). The better the layer adhesion, the more isotropic your part will be.</p><p>6. Heat resistance: The max temperature an object can withstand before softening or deforming.</p><p>We have ranked each material with the following criteria on a simple scale (low to high). These are relative grades for the FDM process—they would look quite different if other manufacturing technologies were taken into account. Using data from Optimatter, the polymers have been ranked along the different criteria considered.</p><p>As a reminder, the grades given in this article are for an average polymer representing the general chemistry, but the performance will vary depending on the actual product or supplier.</p><h2>What is PLA?</h2><p>PLA is the easiest polymer to print and provides good visual quality. It is very rigid and actually quite strong, but is very brittle.</p><p>PLA is bio-sourced and biodegradable, has good UV resistance and can be post-processed with sanding paper and painted with acrylics. It's also distinctly odorless. On the flip side, PLA does have low humidity resistance and can't be glued easily.</p><h2>What is ABS?</h2><p>ABS is usually picked over PLA when higher temperature resistance and higher toughness are required. It has good abrasion resistance, can be post-processed with acetone vapors for a glossy finish and can be post-processed with sanding paper and painted with acrylics.</p><p>ABS is sensitive to UV and potentially comes with high fume emissions. It develops an odor during the printing process.</p><h2>What is PET?</h2><p>PET is a slightly softer polymer that is well rounded and possesses interesting additional properties with few major drawbacks.</p><p>Aside from its high resistance to humidity and chemicals, PET is also safe to come into contact with foods, is recyclable and has noteworthy abrasion resistance. Like the materials listed previously, it can be post-processed with sanding paper and painted with acrylics.</p><p>The only notable drawback is that it's heavier than PLA and ABS.</p><h2>What is Nylon?</h2><p>Nylon possesses great mechanical properties, and in particular, the best impact resistance for a non-flexible filament. It has excellent chemical resistance and is very strong.</p><p>For Nylon, layer adhesion can be an issue. The material absorbs moisture and printing with it has the potential to release emissions.</p><p>In this analysis, we’re talking only about Nylon 6. We aren't covering Nylon 11 and 12 here.</p><h2>What is TPU?</h2><p>TPU is mostly used for applications where material flexibility is required, though it also sports very high impact resistance. It's quite abrasion-resistant and isn't affected significantly by coming in contact with oil and grease.</p><p>However, TPU is difficult when it comes to post-processing and can't be glued easily.</p><h2>What is PC?</h2><p>PC (polycarbonate) is one of the strongest materials of all for FDM 3D printing and can be an interesting alternative to ABS as the properties are quite similar.</p><p>The material can be sterilized and is easy to post-process, though it is UV sensitive.</p>" },
    "7": { "title": "SLA 3D printing materials compared", "content": "<p>SLA (Stereolithography) 3D printing can produce plastic parts with high resolution and accuracy, fine details and smooth surface finishes. Thanks to the variety of resins available for SLA, this manufacturing process is popular among many industries for a variety of applications.</p><p>Standard resins, for instance, are often used for general prototyping and engineering resins are chosen for applications requiring specific mechanical and thermal properties. Dental and medical resins come with biocompatibility certifications.</p><p>In this article, we explore the most common SLA material options to highlight the key advantages of each and give actionable guidelines to help you choose the right one for designing custom parts with SLA.</p><h2>What materials are available for SLA 3D printing? What do SLA resins do best?</h2><p>SLA uses a UV laser to cure liquid resin into hardened plastic in a process called photopolymerization. Different combinations of monomers, oligomers, photoinitiators, and various other additives that comprise a resin result in different material properties.</p><p>SLA produces parts from thermoset polymers. Here are the main benefits and limitations that are common to all SLA materials:</p><p><strong>Pros</strong></p><p>Similar smoothness to injection molding</p><p>Fine features & high detail</p><p>High stiffness</p><p><strong>Cons</strong></p><p>Relatively brittle (low elongation at break)</p><p>Not suitable for outdoor use, as the material properties may change over time (especially with overexposure to UV radiation)</p><p>Susceptible to creep</p><p>In the following sections, we will go deeper into material properties that are specific to each SLA resin.</p><h2>What are the standard SLA resins? Common 3D printing materials</h2><p><strong>Standard resin:</strong> Standard resins produce high-stiffness, high-resolution prints with a smooth injection molding-like finish. Their low cost makes them ideal for prototyping applications.</p><p>The color of the resin affects its properties. For example, grey resin is better suited for parts with fine details, and white resin for parts that require a very smooth surface.</p><p>Standard resin is ideal for concept modeling, rapid prototyping and using 3D printing for more artistic endeavors.</p><p><strong>Pros</strong></p><p>Fine features & high detail</p><p>Smooth surface finish</p><p>Very cost-efficient</p><p><strong>Cons</strong></p><p>Brittle (low elongation at break)</p><p>Low impact strength</p><p>Low heat deflection temperature</p><p><strong>Clear resin:</strong> Clear resin has similar mechanical properties to standard resin but can be post-processed to near optical transparency.</p><p>Clear resin is ideal for showcasing interior features, housings for LEDs and fluidic devices.</p><p><strong>Pros</strong></p><p>Fine features & high detail</p><p>Smooth surface finish</p><p>Transparent</p><p><strong>Cons</strong></p><p>Brittle (low elongation at break)</p><p>Low impact strength</p><p>The optical clarity may change over time, as the part is exposed to UV radiation (sunlight)</p><h2>What are engineering SLA resins? 3D printing materials for production</h2><p><strong>Tough resin (ABS-like):</strong> Similar to ABS, tough resin was developed for applications requiring materials that can withstand high stress and strain. Parts printed in tough resin have tensile strength (55.7 MPa) and modulus of elasticity (2.7 GPa) comparable to ABS.</p><p>Tough resin is ideal for functional prototypes and mechanical assemblies.</p><p><strong>Pros</strong></p><p>High stiffness</p><p>Excellent resistance to cyclic loads</p><p><strong>Cons</strong></p><p>Not suitable for parts with thin walls (recommended minimum wall thickness of 1 mm)</p><p>Low heat deflection temperature</p><p>Relatively brittle (low elongation at break)</p><p><strong>Durable resin (PP-like):</strong> Durable resin is a wear-resistant and flexible material with mechanical properties similar to Polypropylene (PP).</p><p>Durable resin is optimal for functional prototypes, consumer products, and low-friction and low-wear mechanical parts.</p><p><strong>Pros</strong></p><p>High wear resistance</p><p>Flexible (relatively high elongation at break)</p><p>High impact resistance (higher than tough resin)</p><p><strong>Cons</strong></p><p>Not suitable for parts with thin walls (recommended minimum wall thickness of 1 mm)</p><p>Low heat deflection temperature</p><p>Low tensile strength (lower than tough resin)</p><p><strong>Heat-resistant resin:</strong> Heat-resistant resin is ideal for applications that require high thermal stability and the ability to operate at high temperatures.</p><p>Heat-resistant resin is ideal for mold prototyping, casting and thermoforming tooling.</p><p><strong>Pros</strong></p><p>High heat deflection temperature</p><p>Smooth surface finish</p><p><strong>Cons</strong></p><p>Brittle (low elongation at break)</p><p>Not suitable for parts with thin walls (recommended minimum wall thickness of 1 mm)</p><p><strong>Rubber-like resin (flexible):</strong> Rubber-like resin allows engineers to simulate rubber parts that are soft to the touch. This material is ideal for wearables prototyping, multi-material assemblies, handles, grips and overmolding.</p><p><strong>Pros</strong></p><p>High flexibility (high elongation at break)</p><p>Low hardness (simulates an 80A durometer rubber)</p><p>High impact resistance</p><p><strong>Cons</strong></p><p>Lacks the properties of true rubber</p><p>Requires extensive support structures</p><p>The material properties degrade over time, as the part is exposed to UV radiation (sunlight)</p><p><strong>Ceramic-filled resin (Rigid):</strong> Rigid resins are reinforced with glass or other ceramic particles and result in very stiff and rigid parts, with a very smooth surface finish.</p><p>Rigid resin is ideal for molds and tooling, jigs, manifolds, fixtures, electrical application housings and automotive parts.</p><p><strong>Pros</strong></p><p>High stiffness</p><p>Suitable for parts with fine features</p><p>Moderate heat resistance</p><p><strong>Cons</strong></p><p>Brittle (low elongation at break)</p><p>Low impact strength</p>" },
    "8": { "title": "3D printed injection molds: Materials compared", "content": "<h2>Introduction</h2><p>Using 3D printing processes to create end-use tooling is becoming more and more common as the capabilities of the technologies increase.</p><p>In this article we focus on a specific tooling application: low-run injection molding. An extensive review of the applications of 3D printing in this area can be found here. In this article, we compare two popular materials that are currently used in the industry for manufacturing injection molds.</p><p>Injection molding is a highly demanding application for a 3D printed material, as the molds have to withstand the processing forces at an elevated temperature and retain their dimensional accuracy over multiple runs. 3D printed injection molds are best suited for:</p><p>Fast turnaround times (1-2 week opposed to 5-7 weeks).</p><p>Applications where production quantities are low (50 - 100 parts).</p><p>Mold designs where changes or iterations are probable.</p><p>Parts that are relatively small (less than 150 mm).</p><h2>Material requirements for mold making</h2><p>A 3D printing material suitable for manufacturing injection molds must have:</p><p>High stiffness: The molds must retain their good dimensional accuracy over multiple runs and withstand the high pressures during material injection without deforming.</p><p>High-temperature resistance: A high heat deflection temperature (HDT) is crucial, not only to ensure that the mold will not fail during material injection but also to enable more precise control of the process.</p><p>High level of detail: Injection molds must have high dimensional accuracy and a smooth surface. Highly accurate molds will produce highly accurate parts.</p><p>The two 3D printing processes that are able to produce highly accurate and smooth parts (without extensive post-processing) are Material Jetting and Stereolithography (SLA). While Material Jetting is an industrial process exclusively, both desktop and industrial SLA systems exist. The available materials and production capabilities of desktop SLA 3D printers are not viable for high-end production though, so they will not be discussed here.</p><p>In this article we focus on two materials that are proven to be suitable for manufacturing low-run injection molds in an industrial environment: the Digital ABS plus for Material Jetting by Stratasys and the Somos PerFORM for SLA by DSM.</p><p>Disclaimer: the material properties listed below are provided by the manufacturers and correspond to parts that have undertaken the optimal thermal post-curing process.</p><h2>Material Comparison</h2><h2>Mechanical properties - Stiffness</h2><p>Somos PerFORM has a very high tensile and flexural strength, not only when compared to Digital ABS, but also among all other industrial 3D printing materials (for example SLS nylon). However, it is more brittle (low elongation at break) and has a lower impact strength. For mold manufacturing, the mechanical properties of Somos PerFORM are preferable, as a high stiffness and strength are the main requirements.</p><h2>Thermal properties - Temperature resistance</h2><p>Heat Deflection Temperature (HDT) indicates the temperature at which a polymer deforms under a certain load. Glass Transition Temperature (Tg) is the temperature region where the thermoset material transitions from a solid “glassy” state to a more pliable “rubbery” state. For injection molding applications, high values of both HDT and Tg are preferable, so Somos PerFORM again outperforms Digital ABS.</p><h2>3D printing process - Level of detail</h2><p>Digital ABS and Somos PerFORM are used in different 3D printing processes. The capabilities of a typical Material Jetting and of a typical industrial SLA system are outlined in the table below. Both technologies can produce very smooth parts with intricate details and require little post-processing. Digital ABS has a small advantage over Somos PerFORM in regards to level of detail, as Material Jetting has the highest dimensional accuracy among all 3D printing technologies (with SLA at a close second).</p><h2>Production Capabilities</h2><p>Both Digital ABS and Somos PerFORM have been used in industrial settings to produce low-run injection molds. The table below summarises the number of parts that a single mold can produce using materials that are considered “easy” and “difficult” to mold (PP and glass fiber-filled PA respectively).</p><p>The differences in mechanical and thermal properties of the two materials have an impact on the total number of parts a mold can produce. Under normal operating conditions (after the first 3-4 runs), the 3D printed mold will reach a temperature of approximately 120°C, as it is heated from the melted material. Good thermal stability is crucial for minimizing the deterioration of the mold. The PA GF test samples of the image below were produced using identical mold designs that were 3D printed in the two materials (both show the part produced after the 10th run). The quality of the part produced with the Digital ABS mold is much lower, as the mold has started to overheat and deteriorate, while the Somos PerFORM mold was still stable.</p><h2>Summary & Conclusions</h2><p>Injection molding is a very demanding tooling application: the material must have both high stiffness and must be able to operate at elevated temperatures.</p><p>Material Jetting and SLA are the only 3D printing processes that can produce parts with the dimensional accuracy and surface finish required for industrial applications. We compared two materials (one for each process) that are used to manufacture 3D printed low-run injection molds.</p><p>Even though Digital ABS plus is an excellent material for most functional applications, the higher stiffness and the superior thermal properties of Somos PerFORM make it more suitable for mold making. This is evident by the number of parts each mold manufactured with the two materials can produce.</p>" },
    "9": { "title": "What are the key design elements for 3D printing?", "content": "<h2>Introduction</h2><p>Every 3D printing technology comes with a distinct set of capabilities and its own design freedoms and restrictions. Whether you are a seasoned engineer who’s well-versed in designing for 3D printing or you are new to the field, it’s always a good idea to go over the most essential factors that make or break a design.</p><p>This article covers the key design considerations that apply to 3D printing in general, regardless of the printer you choose for manufacturing your custom parts.</p><h2>Quick design reference for 3D printing</h2><p>Check out this handy infographic for quick access to every essential design element you may need while creating digital models to 3D print.</p><h2>How to design parts for 3D printing</h2><p>Each 3D printing process has its own design advantages as well as some limitations. Let’s break down the key design considerations that apply to every 3D printing technology to keep in mind when designing your next custom parts.</p><h2>Designing 3D models with overhangs</h2><p>All 3D printing processes build parts layer-by-layer. New layers can’t be deposited onto thin air, so every layer must be printed over some underlining material.</p><p>Overhangs are areas of a model that are either partially supported by the layer below or not supported at all. There is a limit on the angle every printer can produce without the need for support material. For example, if you’re printing with an FDM and SLA machine, this angle is approximately 45 degrees.</p><p>We recommend limiting your model’s overhangs, as layers printed over support structures usually come out with a rougher surface finish.</p><h2>Wall thickness for 3D printing</h2><p>The second thing to keep in mind when designing a part to be 3D printed is wall thickness. Every 3D printing process has its own level of precision. FDM, for instance, is the least accurate, while SLA has the tightest tolerances. In terms of part stability, every 3D printing process has a lower limit regarding wall thickness and feature size.</p><p>For example, imagine you are an engineer designing a new generation of hang gliders. You’ve chosen to 3D print a scaled-down version of the product to test its efficacy. 3D modeling programs allow you to model the sailcloth of the wing, for instance, but you then encounter problems when you would try to 3D print it. This is because the model’s wall thickness is less than the minimum required for successful printing.</p><p>It’s essential to make sure that your 3D designs have walls that meet the minimum required thickness for the printing process you choose. All 3D printers can successfully print components with wall thicknesses greater than 0.8 mm.</p><h2>What is warping and how can you avoid it?</h2><p>Something that is often easily overlooked while designing a 3D model is the fact that the materials used for 3D printing undertake physical change: they are melted, sintered or scanned with a laser and solidified. The heating and cooling of material can cause the parts to warp while printing.</p><p>Large, flat surfaces can be especially prone to warping. Warping can typically be avoided by using correct machine calibration and having adequate surface adhesion between your part and the print bed. A good practice is to avoid large flat surfaces and add rounded corners to your 3D models.</p><h2>Designing the right level of detail</h2><p>When you are creating a 3D model with intricate details, it is important to keep in mind the minimum feature size each 3D printing process can handle. The minimum level of detail is connected to the capabilities and mechanics of each 3D printing process and to the selected layer height.</p><p>The process and materials used will have an impact on the speed and cost of your print, so determining whether smaller details are critical to your model is an important design decision.</p><h2>Using digital tools to design physical components</h2><p>The most important thing to remember while designing for 3D printing is the fact that your digital design will become a physical object. In the digital design environment, there are no laws of physics to adhere to, such as gravity.</p><p>Anything can be 'drawn' in 3D on a digital canvas, but not everything can be 3D printed. Knowing the key factors that go into designing 3D models will ensure that you produce digital designs that can be successfully printed.</p><h2>What’s the best CAD software for 3D printing designs?</h2><p>There is a wide range of CAD programs available for designing 3D models. The most well-known of these (and arguably the best for most applications) is Autodesk’s AutoCAD, first released for personal computers in 1982. Others include Fusion360, TinkerCAD and Solidworks. For a more in-depth exploration of all the major CAD programs, check out our article on design software.</p><h2>Do you need additional software for 3D printing with XYZ Canada?</h2><p>You don’t need to install any additional software apart from CAD to start producing custom parts with XYZ Canada. Our manufacturing partners are equipped with the best slicing software and a wide variety of machines for all your custom part requirements.</p><h2>Should you avoid overhangs in your 3D models?</h2><p>We recommend avoiding overhangs when possible by designing models to be 3D printed. Try not to design your parts with angles over 45 degrees.</p><h2>What’s the minimal wall thickness for 3D printed parts?</h2><p>All 3D printers used within the Protolabs Network manufacturing network can print parts with wall thicknesses of 0.8 mm and over.</p><h2>How do you keep your parts from warping?</h2><p>To ensure that your custom parts don’t warp, we recommend avoiding large flat surfaces and using rounded corners in your designs.</p>" },
    "10": { "title": "How to design parts for FDM 3D printing", "content": "<h2>Introduction</h2><p>As the most affordable 3D printing technology on the market, fused deposition modeling (FDM) is a great choice for quick, low-cost prototyping and can be used for a wide variety of applications. It can also be an effective solution for functional parts, such as enclosures.</p><p>Like all manufacturing methods, FDM has some limitations and constraints on what can be printed. This article explains how you can adjust your designs for optimal FDM print quality.</p><h2>What is the FDM printing process?</h2><p>Fused deposition modeling (FDM) is an additive manufacturing process that uses the technique of material extrusion. Also known as fused filament fabrication (FFF), FDM is the most widely used 3D printing technology.</p><h2>How do you design for FDM printing?</h2><p>To achieve the best results, keep FDM’s capabilities and constraints in mind when designing a part for FDM printing.</p><h2>Bridging</h2><p>Bridging in FDM occurs when the printer is required to print between two supports or anchor points. Because there is nothing to build on, no support is offered for the initial layer being printed and the material tends to sag. Bridges most often occur in horizontal-axis holes found in the walls of objects or in the top layer (or roof) of hollow parts.</p><p>One solution is to reduce the distance of the bridge, but the impact of this depends on the part’s design constraints. Another solution to avoid sagging is to include support. Support offers a temporary platform for the bridging layer to be built upon. The support material is removed once the print is completed, although it can leave marks on or damage the surface where the support was connected to the final part.</p><p>Key design consideration: Due to the nature of FDM, sagging or marks from support material are to some extent always present unless the bridge is less than 5mm. If a smooth, level surface is required, an advanced solution is to split the design into separate parts or do some form of post-processing.</p><h2>Vertical axis holes</h2><p>FDM often prints undersized vertical-axis holes. The printing process for such a hole and the reason its diameter gets reduced can be summarized as follows:</p><p>As the nozzle prints the perimeter of a vertical axis hole, it compresses the newly printed layer down onto the existing build layers to help improve adhesion. The nozzle’s compressing force deforms the extruded round layer shape from a circle into a wider, flatter shape. This increases the area of contact with the previously printed layer, improving adhesion but widening the extruded segment. This causes a decrease in the hole diameter being printed.</p><p>The amount of undersize depends on the printer, slicing software, hole size and material. The reduction in diameter of vertical axis holes is often taken into account by the slicing program, but accuracy can vary. Several test prints may be needed to achieve the desired accuracy. If a high level of accuracy is required, it may be necessary to drill the hole after printing.</p><p>Key design consideration: If the diameter of the vertical axis hole is critical, the recommendation is to print it undersized and then drill the hole to the correct diameter.</p><h2>Overhangs</h2><p>Issues with overhang are one of the most common FDM print-quality problems. Overhangs occur when the printed layer of material is only partially supported by the layer below. As with bridging, the inadequate support provided by the surface below the build layer can result in poor layer adhesion, bulging or curling.</p><p>Depending on the material, an overhang can usually be printed up to 45° without compromising quality. At 45°, the newly printed layer is supported by 50% of the previous layer. This creates sufficient support and adhesion to build upon. Above 45°, support is required to ensure that the newly printed layer does not bulge down and away from the nozzle.</p><p>Key design consideration: You can overcome the limitations of overhangs by using support for wall angles above 45°. For larger overhangs needing support, expect marks to be present on the final surface unless post-processed.</p><h2>Corners</h2><p>Because FDM printing nozzles are circular, corners and edges have a radius equal to the nozzle size. This means that these features are never perfectly square.</p><p>For sharp edges and corners, the first layers of a print are especially important. As discussed above for vertical holes, with each print layer, the nozzle compresses the print material down to improve adhesion. For the initial print layer, this creates a flare often called an “elephant's foot.” Protruding outside the specified dimensions, this flare can impact the ability to assemble FDM parts.</p><p>Another common issue concerning the first layer of an FDM print is warping. Compared to PLA, ABS is more vulnerable to warping due to its high printing temperature. The base is the first layer to be printed. It cools as the other hot layers are printed on top. This causes differential cooling, and can result in the base layer curling up and away from the build plate as it shrinks and contracts.</p><p>Key design consideration: If assembly or overall dimensions are critical to the function of an FDM part, include a 45° chamfer or radius on all edges touching the build plate. For high-precision form-and-fit testing, we recommend other technologies such as SLA or PolyJet.</p><h2>Vertical pins</h2><p>Vertical pins are often printed with FDM when assembly of parts or alignment is required. It is critical to understand the size of vertical pins that FDM can accurately print since these features are often functional.</p><p>Large pins (greater than 5mm diameter) are printed with a perimeter and infill, affording a strong connection to the rest of the print. Smaller diameter pins (less than 5mm diameter) can be made up of only perimeter prints with no infill. This creates a discontinuity between the rest of the print and the pin, resulting in a weak connection susceptible to breaking. Correct printer calibration can often reduce the likelihood of small-pin failure.</p><p>Key design consideration: If your design contains pins smaller than 5mm in diameter, add a small fillet at the base of the pin. If function is critical, consider including a hole in your design in the location of the pin, drill the hole to the correct size and insert an off-the-shelf pin.</p><h2>Tips for advanced FDM design</h2><p>When printing with FDM, consider how to reduce the amount of support required, a part’s orientation and the direction the part is built on the build platform.</p><p>Splitting your model: Splitting a model can often reduce its complexity, saving costs and time. Overhangs that require a large amount of support may be removed by simply splitting a complex shape into sections that are individually printed. If desired, the sections can be glued together once printing is completed.</p><p>Hole orientation: The best way to avoid support for holes is by changing the print orientation. Removal of support in horizontal-axis holes can often be difficult, but rotating the build direction 90° eliminates the need for support. For components with multiple holes in different directions, prioritize blind holes, followed by holes with smallest to largest diameters and then the criticality of hole size.</p><p>Build direction: Due to the anisotropic nature of FDM printing, understanding the application of a component and how it is built are critical to the success of a design. FDM components are inherently weaker in one direction due to layer orientation. Since the layers are printed as a round-ended rectangle, the joints between each layer are actually small valleys. This creates a stress concentration with a tendency to crack.</p><h2>FDM 3D printing best practices</h2><p>If a bridge exceeds 5mm, sagging or marks from support material can occur. Splitting the design or post-processing can eliminate this issue. For critical vertical-hole diameters, drill after printing to achieve higher accuracy. The addition of support will allow FDM printers to print wall angles greater than 45°. Include a 45° chamfer or radius on all edges of an FDM part touching the build plate. For applications with small vertical pins, add a small fillet at the base or consider inserting an off-the-shelf pin into a printed hole instead. Splitting a model, reorienting holes and specifying build direction are all factors that can lower cost, accelerate the printing process and improve a design’s strength and print quality.</p>" },
    "11": { "title": "How do you design enclosures for 3D printing?", "content": "<h2>Introduction</h2><p>3D Printing of enclosures allows design freedom, lets a designer print a prototype or final part in a matter of hours and is much cheaper when compared to traditional manufacturing methods. 3D printed enclosures offer an effective method of confirming form and fit and several of the materials that can be used for printing enclosures are suitable for end use applications.</p><p>This article will discuss the most common 3D printing technologies that are used to print enclosures, methods for securing printed enclosures together and introduce some design considerations to help optimize enclosure design for 3D printing.</p><h2>Applications</h2><p>Rapid prototyping: Prototyping plastics are a cost effective and quick method of printing enclosures. Technology: FDM.</p><p>High Temperature: Heat resistant plastics are rated to remain stable up to temperatures as high as 80℃ after thermal post treatment. Technology: Material Jetting.</p><p>High quality surface finish: The selection of surface finish is usually governed by cost and time. SLS nylon results in a satin-like matte finish that is slightly grainy to the touch while Material Jetting and SLA offer fine-detail models with very smooth surfaces. Technology: Material Jetting.</p><p>High accuracy: SLS nylon, SLA and Material Jetting printed parts are highly accurate and are capable of printing to within 0.2 - 0.5 mm. They give an excellent surface finish. SLS nylon does not require any support while the support used for material jetting is typically dissolvable and easy to remove resulting in a smooth surface after post processing. Technology: SLA, SLS or Material Jetting.</p><p>Transparent: 3D printed transparent plastics allow for inspection or verification of internal components and are often applied to applications where fluids are being employed. Technology: SLA or material jetting.</p><p>Flexible material: Flexible enclosures allow the pressing of buttons or motion of switches through the sealed case. Technology: Rubber-Like plastics or SLA flexible resin.</p><h2>Securing enclosure assemblies</h2><p>Snap fits, interlocking joints, threaded fasteners, and living hinges are all viable options for 3D printed enclosure connections. Designing snap-fits and push-fits for an enclosure that does not require repeated opening is much easier because the joint does not have to be as wear-resistant. For quick prototypes, adhesives are a quick and easy method to permanently fasten the enclosure.</p><h2>Designing 3D printed enclosures</h2><p>The design of enclosures for 3D printing typically follows 2 main steps:</p><p>1. Enclosure planning and component measurement: It can be useful to 3D model the internal enclosure components along with the enclosure to allow for easy clearance checks and to help determine the optimal component positions.</p><p>2. Designing the structure: While tolerance and clearance recommendations will vary with printer technology and calibration the bullet points below offer a set of design guidelines to use:</p><p>Wall thickness: A minimum wall thickness of 2 mm is recommended for all enclosure walls.</p><p>Add radii/fillets to corners: Radii or fillets help to reduce stress concentrations at corner and edges and also make parts easier to 3D print. Even a small radius can make a big difference.</p><p>Component clearance: Allow 0.5 mm around all internal components to compensate for distortion, shrinkage and printer tolerances. The accuracy 3D printers are able to produce parts varies by technology.</p><p>Clearance holes: Add 0.25 mm to the diameter of screw and fastener clearance holes. For more accurate clearance holes, drill the holes after printing.</p><p>Self-tapping holes: Subtract 0.25 mm from the diameter of holes if you are wanting the screw or fastener to bite into the case.</p><p>Port clearance: For all ports or plugs allow 2 mm clearance (1mm each side). The input port can also be super glued into place for a secure connection.</p><p>Add lugs: Add lugs, cut outs and lips to assist with assembly/disassembly and alignment if the enclosure has multiple parts (base & lid). Lugs should be a minimum of 5mm in width.</p><p>Ribs and gussets: While ribs and gussets are critical design features of injection molding and not essential for 3D printing, their inclusion can help reduce and distribute stresses throughout the part and improve rigidity. To save on material, ribs and gussets can be designed to 75-80% of wall thickness.</p><p>Bosses: Include bosses around holes in locations where threaded fasteners will be used to reduce the likelihood of bulging, distortion and potential fracture. A minimum of 1 hole diameter for the wall thickness around the hole is a good starting point (e.g., if the hole is for an M5 screw include a minimum 5mm of wall thickness around the hole).</p><p>Uniform wall thickness: If your enclosure design is eventually going to be injection molded remember to use uniform wall thickness in your design. For 3D printing processes (particularly SLS and SLA) this is good design practice.</p><h2>Rules of thumb</h2><p>For enclosures that will experience repeated opening and closing, a wear-resistant material such as SLS nylon is recommended. For rapid prototypes where form or fit are being tested, FDM provides a fast low-cost method of production. If the enclosure will be subjected to loads, include gussets, ribs, and bosses to improve strength. A minimum wall thickness of 2 mm, 0.5 mm tolerance around internal components and ± 0.25 mm for clearance/bite holes are good start points to consider when designing a 3D printed enclosure.</p>" },
    "12": { "title": "How do you design snap-fit joints for 3D printing?", "content": "<h2>Introduction</h2><p>Snap-fit joints are a quick and easy way to connect two 3D-printed components by using interlocking features. Not only are they a low-cost and time-saving connection method, but they can also reduce the number of parts needed in an assembly. Plus, they offer the possibility of rapid assembly and disassembly.</p><p>This article covers the basics of snap-fit joints (also called connectors and clips) for 3D printing, what to consider when designing snap-fits with plastics and thermoplastics and which 3D printing process is optimal for manufacturing the best snap-fits.</p><h2>Watch before you read: does Protolabs Network have a snap-fit tutorial?</h2><p>The answer is yes: we do have a tutorial to help engineers design perfect snap-fits. Before (or after) diving into this comprehensive guide, check out this nifty video with detailed instructions for 3D printing snap-fits in style.</p><h2>What are snap-fit joints (or connectors/clips)?</h2><p>A snap-fit joint is a cost-effective and relatively simple method of attaching two 3D-printed plastic components. Also known as a connector or clip, a snap-fit generally consists of a small and bendable protrusion, like a bead, stud, or hook, and a mating depression that deflects and catches the protruding feature. The two features clicking into place create a robust interlocking connection.</p><p>Once the features have clicked into place, an undercut holds the two components of the snap-fit together. Depending on the shape of this integral undercut, snap-fit assemblies can also be designed to make the interlocking connection permanent. A well-designed snap-fit joint with the right material can be used quite a number of times without any noticeable mechanical fatigue.</p><p>There are plenty of types of snap-fit types and geometries that follow the basic principles of two interlocking components.</p><h2>Common types of snap-fits: cantilever and annular joints</h2><p>The two most widely used and commonly effective types of snap-fit connectors are cantilever and annular joints. Let’s break these down.</p><h2>Cantilever snap-fit joints</h2><p>The most common snap-fit joint is the cantilever, consisting of a protrusion (some type of bead or hook) on one end of the component and a structural support feature at the other end. This protrusion is placed into an opening and bends back to lock the connection into place. Cantilever snap-fits are easy to design and intuitive when it comes to assembly and disassembly. For many applications and cases, cantilevers are the most cost-effective way to connect to components.</p><h2>Annular snap-fit joints</h2><p>Annular snap-fit joints use a hoop strain to hold a pressed part in place. Common examples of annular snap-fits are bottle and pen caps. With annular snap-fits, it’s possible to create a waterproof seal around the joint.</p><h2>What are the advantages of snap-fitting with 3D printing?</h2><p>While injection molding is often seen as the more robust way to produce snap-fit joints, 3D printing is a viable alternative (and even a go-to) with the right design and materials. 3D-printed snap-fits don’t have any of the design limitations associated with injection molding—for instance, draft angles, separation lines, wall thickness and undercuts—and can be designed and altered with ease. This makes them ideal for rapid prototyping, where clearance and fit are critical. This is why designers generally use 3D printing for snap-fits in enclosures.</p><h2>What materials are used for 3D printing snap-fit joints?</h2><p>Every 3D printing process has its pluses and minuses when it comes to producing parts with snap-fit connectors. This is due in part to the materials used with each of the major additive manufacturing technologies.</p><p>FDM is the most cost-efficient way to manufacture snap-fit connectors. While it’s definitely effective, the process has lower accuracy than other printing methods. If you choose FDM, we recommend using strain-resistant materials, such as ABS, Nylon and TPU.</p><p>SLA resins are also a viable option for making snap-fit joints, but they are relatively brittle. Using resins may increase the chances of the snap-fit breaking after repeated use. We recommend durable SLA resin if you print snap-fits with this technology.</p><p>SLS is more suitable than FDM and SLA for printing functional snap-fit prototypes and end-use parts that will be opened and closed many times. The best material for maximum tear resistance is SLS Nylon.</p><p>Similar to SLS, MJF (HP's Multi Jet Fusion) is optimal for manufacturing snap-fit connectors. MJF produces robust parts from Nylon PA 12 and a few other nylon and polypropylene options. For MJF, we recommend a minimum thickness of 1 mm at the base of the cantilever and a minimum common overhang depth of at least 1 mm.</p><h2>What are common problems with designing snap-fit joints?</h2><p>The snap-fit design process isn’t the same for all technologies, materials and applications. Engineers faced with snap-fit design for 3D printing often encounter a few key challenges. Sharp corners in the design may add stress to a cantilever, raising the probability of the joint breaking off. Constant stress on plastics and thermoplastics tends to cause creeping (deformation), which may weaken or compromise the snap-fit over time. Misplaced gaps in parts will cause tolerance issues, making it harder for components to fit together. The more you assemble and disassemble snap-fit joints, the more likely you are to come across fatigue failure.</p><h2>What are the right tolerances for snap-fit joints?</h2><p>3D printing properties can vary quite a bit, from printer calibration and materials to the printer technology itself. Because of these varying factors, there are no strict tolerancing rules for printing snap-fit joints and connectors. For FDM: 0.5mm tolerance. For SLA, SLS and MJF: 0.3mm tolerance.</p><h2>What are the best practices for designing 3D-printed snap-fits?</h2><p>Taper the design: A snap-fit cantilever with a constant cross-section has an uneven distribution of strain. Reducing the cross-section of the cantilever beam over its length uses less material and results in a more even distribution of strain. Fillet the base of the cantilever: Adding a fillet at the base of a cantilever distributes stress over a broader area, strengthening the connection. Increase the width: Increasing the clip's width strengthens the design, provided it fits design constraints. Deflect during assembly: Ensure the snap-fit cantilever deflects only during assembly, not when components are connected. Consider build direction: Avoid designing cantilevers built in the z-direction due to anisotropic printing. Add lugs: Adding lugs assists with component alignment and helps share shear loads.</p><h2>Our top tips & tricks for designing snap-fit joints</h2><p>Sound design principles make or break snap-fit joints. Use good design practices to reduce stress (e.g., fillets, build direction, locating lugs) and strain (e.g., tapered profiles, cantilever width). Choose the right tolerances for different 3D printers: 0.5mm for FDM connectors and 0.3mm for other 3D printing processes. Think about materials: Prototyping plastics are ideal for design confirmation, but stronger materials like SLS or MJF options are better for repeated use.</p>" },
    "13": { "title": "3D printing low-run injection molds", "content": "<h2>Introduction</h2><p>Injection molding is the most common method for mass producing plastic parts. It is ideal for producing rapidly very large numbers of identical parts with tight tolerances.</p><p>In the past, 3D printing was used in the design and manufacturing process to only create and verify prototypes that would be later injection molded. Nowadays, technology developments in printer accuracy, surface finish and materials allow 3D printers to also directly manufacture the molds.</p><p>This article discusses the benefits of using 3D printing for manufacturing low-run injection molds and gives advice on the possible mold configurations, the available 3D printing mold materials and the best design practices for creating 3D printed injection molds.</p><h2>What is injection molding?</h2><p>Injection molding is the process of creating components by injecting under pressure melted material into a die. The material fills the hollow cavities of the mold and when it cools it solidifies, taking the form of the die. The die then opens, the solid part is ejected and the process repeats. Automating this process can yield very high production rates. Thermoplastic polymers are commonly used, though some thermosetting plastics can also be molded.</p><p>The high initial setup costs associated with injection molding make this technology cost-effective only at high volumes. These costs range between $10,000 and $100,000, mainly due to the engineering and manufacturing of the injection molding dies. Injection molding is typically used for producing thousands or millions of components.</p><p>Low-run injection molding applies to runs of 10-100 parts. Traditionally, such small runs were not feasible due to high tooling costs.</p><h2>Why use 3D printing?</h2><p>For low-run molding, wear resistance is no longer critical. Technologies like Material Jetting and SLA can produce parts with high accuracy and excellent surface finish. Modern temperature-resistant 3D printing materials combined with the design freedom of 3D printing make 3D printed molds viable for low-run injection molding. Benefits include quick verification of mold design and reduced financial risk compared to metal molds.</p><p>3D printed molds are best suited for fast turnaround times (1-2 weeks), low production quantities (50-100 parts), mold designs with potential changes, and small parts (less than 150 mm).</p><h2>3D printed mold configurations</h2><p>There are two standard configurations for 3D printed injection molds:</p><p><strong>Mold inserts in aluminum frames:</strong> This configuration provides support against pressure and heat, reduces warping, and produces more accurate parts.</p><p><strong>Stand-alone molds:</strong> Fully 3D printed molds allow for intricate cooling channels but require more material, increasing print cost and time, and are prone to warping after extended use.</p><h2>How to design a 3D printed injection mold</h2><p><strong>Materials:</strong> A suitable 3D printing material must have high temperature resistance, high stiffness/toughness, and high detail accuracy. SLA and Material Jetting are ideal technologies, offering high dimensional accuracy and fine features. Materials like Formlabs High Temp resin and Stratasys Digital ABS are recommended for molding and tooling applications.</p><p><strong>Mold Design:</strong> Good practices for designing 3D printed molds include:</p><p>1. Orienting inner mold faces to avoid contact with supports for improved surface quality.</p><p>2. Adding shallow air vents (0.05 mm deep) to expel trapped air.</p><p>3. Including channels for metal rods/tubes for molds used in more than 20 runs.</p><p>4. Printing molds at lower layer heights to reduce visible print lines.</p><p>5. Offsetting embossed/engraved details by at least 1 mm.</p><p>6. Adding 0.125mm thickness to mold plates for compression forces.</p><h2>Designing parts for injection molding</h2><p>As with traditional injection molds, consider:</p><p>Adding draft angles (2° or more) for easy part removal, maintaining uniform wall thickness, using thin walls and features, rounding edges, and including ribs and gussets for strength.</p><p><strong>Reducing Flash:</strong> Flash can occur due to imperfect mold mating or overfilling. Adding 0.125mm thickness to mold plates, increasing clamping force, and polishing the split plane can mitigate this issue.</p><p><strong>Release Compound:</strong> Applying a release compound reduces the force needed for part removal, minimizing mold deterioration.</p><h2>Case study: a plastic motor fitting</h2><p><strong>Requirements:</strong> 25 ABS parts, high dimensional accuracy, 40 mm diameter, 5 grams weight, black color.</p><p><strong>Options:</strong></p><p>1. <strong>Industrial FDM:</strong> Cost-effective with good accuracy but anisotropic mechanical performance. Material cost: $90-$110/kg.</p><p>2. <strong>SLA 3D printed molds:</strong> High accuracy for low runs. Material cost: $150-$170/liter.</p><p>3. <strong>Traditional injection molding:</strong> High accuracy and repeatability, but high setup costs. Material cost: $2-$3 for ABS pellets.</p><p><strong>Cost comparison:</strong></p><p>Industrial FDM: Mold cost: N/A, Cost per part: $3.69, Total: $92.25, Lead time: 4 days.</p><p>SLA molds: Mold cost: $70.85, Cost per part: $0.05, Total: $72.10, Lead time: 2 days.</p><p>Traditional IM: Mold cost: $1660.72, Cost per part: $1.89, Total: $1711.48, Lead time: 8 days.</p><h2>Next steps</h2><p>For low-run injection molding with 3D printed molds, you can:</p><p>1. 3D print molds in heat-resistant material for your in-house injection molding.</p><p>2. Outsource production to professional injection molding manufacturers like Protolabs Network for volumes of 100 to 10,000+ units.</p><h2>Rules of Thumb</h2><p>3D printing injection molds is the most cost-effective way for low-run molding. Material Jetting and SLA are the best-suited technologies. Use draft angles (2° or more) and release compounds to extend mold life. Keep part volume under 165 cm³. Each 3D printed mold is suitable for approximately 30-100 runs.</p>" },
    "14": { "title": "3D printing for aerospace and aviation", "content": "<h2>Introduction</h2><p>3D printing is a clear fit for many prototyping and end-use applications within the aerospace and aviation industry. Parts produced via additive manufacturing can be stronger and lighter than those made using traditional manufacturing.</p><p>Aerospace was a very early adopter of 3D printing and still continues to contribute heavily to its development. Companies in this industry began using 3D printing in 1989, and in 2015, aerospace accounted for 16% of additive’s $4.9B global revenue.</p><p>This article explores how 3D printing has made an impact on the aerospace industry. It discusses design requirements for airplane parts, gives recommendations for common and niche aerospace applications, and examines the best materials for 3D printing in this field, along with a case study.</p><h2>Implementing 3D printing in the aerospace design workflow</h2><p><strong>Design communication:</strong> Aerospace designs often begin as concept models showcasing a component of an aircraft. SLA printing and Material Jetting produce high-detail, smooth models for aerodynamic testing, allowing design intention to be clearly communicated.</p><p><strong>Validation:</strong> Prototyping using 3D printing is commonplace, ranging from low-cost FDM full-size parts to high-detail SLA concept models. Engineering-grade materials enable full testing and validation of prototypes.</p><p><strong>Pre-production:</strong> 3D printing enables rapid, low-cost tooling for processes like injection molding, thermoforming, and jigs. This approach validates designs before investing in high-cost tooling and provides production components for runs of up to 10,000 parts.</p><p><strong>Production:</strong> Advances in 3D printing speed, size, and materials now support medium-sized production orders, particularly for high-end aircraft interior components.</p><p><strong>Customization:</strong> 3D printing supports the creation of highly complex, one-off components, reducing air drag and improving fuel efficiency. Parts can be tailored for specific aircraft or functions, integrating topology optimization and part consolidation.</p><h2>How is 3D printing used in aerospace engineering?</h2><p><strong>Jigs & Fixtures:</strong> Companies 3D print hundreds of fixtures, guides, templates, and gauges for each aircraft, reducing cost and lead time by 60-90% compared to traditional methods.</p><p><strong>Surrogates:</strong> Placeholder parts used during production or training, commonly used by NASA and Air Force bases.</p><p><strong>Mounting brackets:</strong> Structural, low-volume metal brackets are printed with DMSL/SLM to mount life-saving systems inside planes.</p><p><strong>High-detail visual prototypes:</strong> Material Jetting produces multicolor designs with a finish comparable to injection molding, ideal for aesthetic parts like dashboard designs and for aerodynamic testing.</p><h2>How does 3D printing improve aerospace manufacturing?</h2><p><strong>Geometric design freedom:</strong> Aerospace parts often require complex geometries, such as internal cooling channels, thin walls, and curved surfaces. 3D printing enables topological optimization, lightweight structures, and integrated functional features.</p><p><strong>Consolidating assemblies:</strong> 3D printing reduces inventory and part counts by combining multiple parts into single components, lowering weight and costs.</p><p><strong>Surface finish:</strong> Technologies like Material Jetting produce injection-molding-like finishes, while metal parts can be polished or CNC-machined for enhanced surface quality.</p><p><strong>Part orientation:</strong> Proper orientation is critical for load-bearing parts due to the anisotropic nature of 3D printing. Design should account for weaker Z-direction properties.</p><p><strong>Support structures:</strong> Supports are necessary for overhangs and steep walls but can impact surface finish. Technologies like SLS and Binder Jetting eliminate the need for supports.</p><h2>What are the best materials for 3D printing aerospace and aviation parts?</h2><p>Check out this comparison of materials for aerospace applications:</p><p><strong>Engine compartment:</strong> Tarmac nozzle bezel (heat-resistant parts) - SLS with Glass-filled Nylon.</p><p><strong>Cabin accessories:</strong> Console control parts (custom knobs) - SLA with Standard Resin.</p><p><strong>Air ducts:</strong> Flexible ducts - SLS with Nylon 12.</p><p><strong>Full-size panels:</strong> Seat backs and entry doors - SLA with Standard Resin.</p><p><strong>Casted metal parts:</strong> Brackets and door handles - SLA or Material Jetting with Castable Resin or Wax.</p><p><strong>Metal components:</strong> Suspension wishbone - DMLS/SLM with Titanium or Aluminum.</p><p><strong>Bezels:</strong> Dashboard interfaces - Material Jetting with Digital ABS.</p><p><strong>Lights:</strong> Headlight prototypes - Material Jetting or SLA with Transparent Resin.</p><h2>3D printing in practice: Printing parts for satellites</h2><p>Satellite designs often require brackets that link the satellite body to reflectors and feeder facilities, enduring temperatures from -170°C to 100°C. Engineers at Airbus overcame these challenges by 3D printing titanium brackets. This method reduced material waste, consolidated parts, optimized geometries, and resulted in lighter components. The lighter weight reduced production costs and will save fuel over the satellite's lifecycle.</p>" },
    "15": { "title": "Medical 3D printing applications", "content": "<h2>Introduction</h2><p>At a rapidly growing rate, the medical industry continues to recognize the added value of additive manufacturing (AM or 3D Printing) for a vast range of medical applications. AM is now used in the development of new surgical cutting and drill guides, orthopedic implants, and prosthetics as well as the creation of patient-specific replicas of bones, organs, and blood vessels.</p><p>A study by Wohlers in 2015 revealed that 13% of all 3D printing revenue comes from companies who are linked to the medical industry. More than 20 different implants ranging from cranial implants to hip, knee, and spinal implants approved by the Food and Drug Administration (FDA) are produced with various AM technologies. Furthermore, to date, more than 100,000 acetabular (hip cup) implants have been produced via AM with approximately 50,000 of them implanted into patients.</p><p>All of these milestones continue to reinforce the important role AM now plays in the medical industry where custom products tailored to each individual can be manufactured. This improves medical professionals' understanding of patients (see Surgical learning tools) and improves patient comfort level by allowing interaction with products that are designed specially for their anatomy.</p><p>This article will discuss the requirements within the medical industry that make AM an ideally suited technology for many applications and present the most common methods of data generation for the production of 3D medical models. Common medical industry applications will also be discussed along with the limitations and restrictions AM must overcome to further impact this industry. Finally, a series of case studies that have made use of AM in the medical industry will be presented.</p><h2>Medical industry requirements</h2><p><strong>Customization:</strong> The individualized nature of health care means that AM is an ideal solution for the medical industry. Rather than manufacture thousands of identical components, AM enables the creation of prosthetic and orthotic devices tailored to a patient’s specific anatomy improving their effectiveness.</p><p><strong>Complexity:</strong> Where in the past, traditional manufacturing may have struggled to create complex, organic shapes, the designs that AM technologies are now able to print are potentially limitless. Thin scaffolds that perfectly follow the contour of a bone or porous metal parts are easily manufacturable opening the door to many applications and designs that were not previously possible (including facial bones, radius and ulna).</p><p><strong>Lead time:</strong> Lead times to create tooling, whether in-house or outsourced, can be lengthy and expensive. One of the hallmarks of AM is that it provides designers and engineers the tools to quickly create and iterate designs, communicate more effectively using realistic prototypes and ultimately reduce time to market. An essential part of the success of any medical device is the feedback from physicians and patients and the speed these design improvements can be implemented at. Within a matter of hours it is now possible to iterate the design of a medical tool based on direct feedback from the surgeon who will use it and print a new prototype for evaluation. The fast feedback loop accelerates design development. Manufacturers can also use early AM parts to support clinical trials or early commercialization while the final design is still being optimized.</p><p><strong>Cost:</strong> As well as the ability to create custom, complex components, AM is best suited for low-volume production meaning cost often drops while effectiveness increases. The individual nature of production means expensive tooling or machining processes are no longer required. AM technologies also only produce parts using the material they need reducing waste and further reducing costs.</p><p><strong>Multi-material prints:</strong> Some AM technologies are now also able to print 3D models from different materials in a single print procedure. The advantage to this is that a model can now have different sections representing bone, organs and soft tissue allowing surgeons and physicians an even greater understanding of how a patient’s body will feel when using a model to practice for surgery or for educational purposes.</p><p><strong>Sterilizability:</strong> Due to the application of some parts used in the medical industry, sterilizability is an important material property. A list of some of the most common sterilizable materials used in AM are shown in the table below.</p><table><tr><th>Material</th><th>Technology</th><th>Acceptable sterilization method</th></tr><tr><td>ABS M30i</td><td>FDM</td><td>Gamma irradiation, ethylene oxide</td></tr><tr><td>PC-ISO</td><td>FDM</td><td>Gamma irradiation, ethylene oxide</td></tr><tr><td>PPSF</td><td>FDM</td><td>Steam autoclave, ethylene oxide, gas plasma, chemical, gamma irradiation</td></tr><tr><td>Ultem</td><td>FDM</td><td>Steam Autoclave</td></tr><tr><td>PA12 (nylon)</td><td>SLS</td><td>Steam autoclave, ethylene oxide, gas plasma, chemical, gamma irradiation</td></tr><tr><td>17-4PH Stainless Steel</td><td>DMLS/SLM</td><td>Steam autoclave, ethylene oxide, gas plasma, chemical, gamma irradiation</td></tr></table><h2>Data generation (CT, MRI, 3D scan)</h2><p>The ability to produce patient-specific parts directly from scan data is an obvious benefit that is not cost-effective with most conventional manufacturing techniques. These tailored parts are made possible through software that converts the patient’s own scans (using techniques like computerized tomography (CT), magnetic resonance imaging (MRI) and laser scanning) into 3D files. These files essentially encode each patient’s specific anatomic or pathologic features, which then can be fabricated by 3D printers.</p><p><strong>CT:</strong> CT uses many x-ray projections through a subject to computationally reconstruct a cross-sectional image. CT is considered the imaging methods of choice for bone imaging and for the collection of data that is then used to produce medical models of hard tissue structures like bone. CT scans are widely used in emergency rooms because the scan takes fewer than 5 minutes. Because patients are exposed to small amounts of radiation CT scans can sometimes be unsuitable.</p><p><strong>MRI:</strong> MRI makes use of a very powerful magnet to align the nuclei of atoms inside the body, and a variable magnetic field that causes the atoms to resonate, a phenomenon called nuclear magnetic resonance. The nuclei produce their own rotating magnetic fields that a scanner detects and uses to create an image. Differences between normal and abnormal tissue are often clearer on an MRI compared to a CT scan. Typically MRI scans also take longer to complete.</p><p><strong>Laser scanning:</strong> Laser scanning scans the surface of an object and captures data represented as a collection of points (a point cloud), which is then used to generate a 3D surface. This enables parts that would be very difficult to precisely measure and 3D model, to be digitized and accurately reproduced. Unlike CT or MRI scanning, laser scanning does not show the internal features of the object being scanned. Also, laser scanners come in a range of sizes for different applications with handheld variations available offering a large advantage over the industrial-sized CT and MRI scanners.</p><h2>Common applications</h2><p><strong>Surgical learning tools:</strong> While much of the focus for 3D printing in the medical industry has been around implants and medical devices used by patients, one of the largest areas of application has concentrated on anatomical replicas. Historically, clinical training, education, and device testing have relied on the use of animal models, human cadavers, and mannequins for hands-on experience in a clinical simulation. These options have several deficiencies including limited supply, expense of handling and storage, the lack of pathology within the models, inconsistencies with human anatomy, and the inability to accurately represent tissue characteristics of living humans.</p><p>Physicians are now using models produced by AM from patient scan data to improve the diagnosis of illnesses, elucidate treatment decisions, plan, and, in some cases, even practice selected surgical interventions in advance of the actual treatments. The models help physicians understand patient anatomy that is difficult to visualize, especially when using minimally invasive techniques. Models also assist in accurately sizing medical devices. Physicians can also use the models to explain an upcoming surgery to patients and their families and to communicate the surgical steps to the clinical team.</p>" },
    "16": { "title": "What is CAD modeling? Comparing design software for 3D printing", "content": "<h2>What is CAD software?</h2><p>CAD (Computer Aided Design), also called 3D modeling, allows engineers and designers to build realistic computer models of parts and assemblies for complex simulations and digital manufacturing. Models created with CAD can be produced as physical components with 3D printing, CNC machining and injection molding.</p><p>CAD software can simulate a wide range of parameters, including strength or temperature resistance before any physical models have been created. Using CAD software enables you to work faster and more cost-efficiently, without compromising on the quality of your components.</p><h2>What is solid modeling?</h2><p>Solid modeling creates solid 3D models as if they are actual parts, with a logical workflow that’s similar to the processes which would be used to manufacture the part. Some of these operations include extruding, drilling and threading. Solid models can intersect, join and subtract objects from one another to create the desired part.</p><p>Another advantage of solid modeling is that it’s usually parametric, meaning that changes or parameters are saved at every stage of the modeling process and can be edited at any time. This allows features of the model to be quickly modified without needing to create the part from scratch.</p><p>Assembly modeling is an important stage in solid modeling, allowing individual parts to be assembled together, forming complex models. Assemblies can be used to insert standard components such as fasteners or bearings, that have been downloaded directly from the manufacturers. Motion elements can also be applied to assemblies, allowing detailed motion analysis to be used to evaluate the mechanical performance of the design.</p><h2>What is surface modeling?</h2><p>Surface modeling is usually used for more aesthetic features of a product. It is much easier to create more organic and free-form geometry using this type of CAD software. Many of the constraints found in solid modeling are not an issue with surface modeling, however, this comes at a cost of sometimes being less accurate.</p><p>As the name suggests surface modeling only deals with the surfaces of the part, with no solid interior. However, once the part has enough surfaces to close the part, it can be filled and then used for 3D printing. When developing designs using surface modeling, it can be hard to go back and make changes because usually, it’s not parametric.</p><p>Each type of modeling software has benefits and drawbacks, depending on the type of design being produced this needs to be considered. Sometimes using both solid and surface modeling is needed to combine the benefits of each.</p><h2>What is sculpting (organic modeling)?</h2><p>Sculpting, or organic modeling, is mainly used for creating freeform surfaces with intricate details such as characters, jewelry or organic shapes found in nature.</p><p>Sculpting software packages such as Pixologic’s ZBrush or Autodesk’s Mudbox were designed with classical sculpting in mind. They allow digital sculptors to start from a simulated ball of clay and use a pressure-sensitive drawing tablet or monitor to manipulate their object with brushes that reflect classic sculpting tools for moving, adding or removing material from their object.</p><p>Using these tools, artists can create sculptures that consist of tens of millions of polygons that capture even the most intricate details.</p><h2>What’s the best CAD software for 3D printing?</h2><p>There are many CAD programs to choose from, each with its own advantages and industry niches. Let’s break down the most common CAD software options by their principal benefits and common file types.</p><table><tr><th>Software</th><th>Description</th><th>Common File Type</th></tr><tr><td>Solidworks</td><td>Solidworks is industry-standard engineering software used for part and assembly modeling. It includes simulation features as well as drawing and assembly tools.</td><td>.sldprt, .sldasm, .slddrw</td></tr><tr><td>Autodesk AutoCAD</td><td>Autodesk AutoCAD, a software package for 2D and 3D CAD, is used across a wide range of industries, by architects, project managers, engineers, graphic designers and many other professionals.</td><td>.dwt, .dwg</td></tr><tr><td>Inventor</td><td>Inventor has very similar features to Solidworks, with professional 3D mechanical design, drawing tools and product simulation tools.</td><td>.ipt, .iam, .idw</td></tr><tr><td>Autodesk Fusion 360</td><td>Autodesk Fusion 360 is similar to Solidworks, with the addition of integrated manufacturing tools and sculpting tools. It’s also available for free for students, enthusiasts, hobbyists and startups.</td><td>.f3d</td></tr><tr><td>Sketchup</td><td>Sketchup is an entry-level software that’s easy to use but comes with basic features. It’s mainly used for applications such as architectural models and interior design.</td><td>.skp</td></tr><tr><td>Solid Edge</td><td>Solid Edge provides solid modeling, assembly modeling and 2D orthographic view functionality for mechanical designers. Solid Edge is a direct competitor to SolidWorks, PTC Creo and Autodesk Inventor.</td><td>.prt, .asm</td></tr><tr><td>PTC Creo</td><td>PTC Creo is a suite of design software with a focus on product design for discrete manufacturers. The suite consists of apps, each delivering a distinct set of capabilities within product development.</td><td>.prt, .asm</td></tr><tr><td>Onshape</td><td>Onshape is a full online CAD software package. It makes extensive use of cloud computing, with compute-intensive processing and rendering performed via servers.</td><td>Cloud Only</td></tr><tr><td>Rhino</td><td>Rhino is a multi-use, freeform surface modeler for engineering, architecture and jewelry design.</td><td>.3dm</td></tr><tr><td>ZBrush</td><td>ZBrush is a digital sculpting tool that combines 3D/2.5D modeling, texturing and painting. The main difference between ZBrush and more traditional modeling packages is that it’s more akin to sculpting.</td><td>.obj</td></tr><tr><td>Autodesk 3ds Max</td><td>Autodesk 3ds Max is a professional 3D computer graphics program for making 3D animations, models, games and images.</td><td>.3ds, .max</td></tr></table><p>All of these CAD programs can output STL or OBJ files for 3D printing, as well as STEP and IGES for CNC manufacturing.</p><h2>What CAD programs are professionals using?</h2><p>In developing this article, we sent a survey to over 750 designers and engineers who’ve used Protolabs Network to see which CAD software they prefer. Let’s explore the results.</p><img src='/images/CAD_1.jpg'><img src='/images/CAD_2.jpg'><p>The survey found that the majority of engineers and designers use Solidworks for CAD design. Engineers tended to prefer AutoCAD, Inventor and Fusion 360 (the only free professional CAD software package on the list), while Rhino proved to be the second most popular modeling tool for designers. Interestingly enough, Rhino did not appear on the list for engineers even though it ranked highly for designers.</p>" },
    "17": { "title": "Simulations in 3D printing", "content": "<h2>Introduction</h2><p>Simulating the fabrication process is slowly becoming part of the 3D printing workflow. 3D printing simulations help to understand and visualize the complex thermo-mechanical phenomena taking place during manufacturing, resulting in the production of high-quality, high-accuracy parts.</p><p>This is especially important for high-value components fabricated using state-of-the-art 3D printing process, where design iterations (discarding a defective print) are very expensive in terms of both material cost and manufacturing time.</p><p>Simulations of the 3D printing process should not to be confused with the more common mechanical FEA simulations: The latter helps evaluate the mechanical performance of a part under certain conditions related to its function (load, deformation, temperature etc), while the former helps predict the result of the 3D printing manufacturing process, layer-by-layer and under certain process parameters.</p><p>In this article we first present the main benefits of simulating each of the 3D printing processes and then we take a closer look at the details of running a successful simulation, giving some handy tips to get you started.</p><h2>Why use simulations in 3D printing?</h2><p>Simulating the 3D printing process is very valuable, because it helps to:</p><ul><li>Avoid print failures and parts rejected for geometric issues, saving time and reducing overall cost.</li><li>Evaluate the risk of production and give pointers to mitigate the probability of failure.</li><li>Understand the physics of the manufacturing process.</li><li>Predict the microstructural characteristics of the end part.</li><li>Optimize production to improve manufacturing speed, reduce post-processing operations or improve accuracy by reducing the part and support deformation.</li></ul><p>You can perform the simulation before or after generating the support structures:</p><p><strong>Before support generation:</strong> Simulation results help identify critical areas of significant deformation or internal stress during manufacturing. The designer can then add adapted support structures to minimize the deformation, change the print orientation to change the areas of heat accumulation or modify the geometry of the 3D model to improve the quality of the end result.</p><p><strong>After support generation:</strong> Simulations help minimize the risk of production failure (for example due to recoater interference), ensure that the dimensions of the final part lie within a specified tolerance range and evaluate the impact of different print parameters (for example, by comparing parameters optimized for production versus parameters optimized for accuracy).</p><p>In both cases, simulations aid in reducing the risk associated with high-value manufacturing and to improve the productivity of high-volume 3D printing, saving weeks of production time and thousands of dollars in development and production costs.</p><h2>Which 3D printing processes to simulate?</h2><p>Simulations are most relevant for high-value and high-precision 3D printing. Moreover, the most popular contemporary 3D printing simulation packages are based on metal welding simulation solvers. Thus simulations are more commonly used with metal 3D printing.</p><p>However, all main 3D printing processes can be simulated and here is why:</p><ul><li><strong>SLM/DMLS:</strong> SLM and DMLS are the oldest and most mature technologies among metal 3D printing processes and, therefore, many software packages focus primarily on them. Because the fusion temperatures of metals are higher than the polymer sintering temperatures, the thermo-mechanical constraints in SLM/DMLS parts are most important.</li><li><strong>EBM:</strong> EBM is a more recent metal 3D printing technology compared to SLM/DMLS and only a few software packages provide solutions for it. Simulations in EBM can help identify the heat accumulation regions generated from the electron beam.</li><li><strong>FDM:</strong> The main issue with FDM is warping, which occurs due to differential cooling of the extruded thermoplastic material. Simulation can help check whether the part needs to be redesigned or whether a brim should be added to increase the adhesion to the platform.</li><li><strong>SLA/DLP:</strong> In SLA and DLP the main issue is curling, which is similar to warping. Not many software solution exist to simulate the SLA printing process at the moment.</li><li><strong>SLS:</strong> In SLS, support structures are not required, but zones of thermal accumulation can appear in the build, resulting in poor surface smoothness or warping. Simulation can help identify these areas.</li></ul><h2>Simulation outputs & results</h2><p><strong>Temperature distribution:</strong> The gradient of temperature is the root cause of all the mechanical phenomena occurring during a build. The temperature gradient can sometimes be computed alone, without any mechanical deformation. It is usually quicker than a full simulation and solving the heat accumulation issues might at the same time solve the mechanical deformation problems.</p><p><strong>Deformation:</strong> Assuming that the true mechanical properties of the material are known, the deformation of the part during manufacture can be calculated. The direction of the deformation is usually correct no matter what simulation parameters are used, but the amplitude of the deformation is closely dependent on the size of the simulation mesh: using a finer mesh will yield more precise results, but requires more time to run.</p><p><strong>Recoater interference:</strong> In powder bed technologies (such as SLS and SLM/DMLS), if the deformation along the z-axis is larger than the layer thickness, the recoater can come in contact with the part, sweeping it away and causing a failure. In some simulation packages, you can define the height of the recoater tolerance and the software will warn you in case a deformation along the z-axis exceeds that threshold.</p><p><strong>Post processing steps:</strong> The primary focus of the 3D printing simulation packages is the computation of thermo-mechanical phenomena occurring during the fabrication of a part. However, other problems can also appear in later steps of the manufacturing process. During the detachment of the part from the build platform or the removal of the support structures, the residual stress from the manufacturing process can cause the part to deform. Heat treatments can help relieve the internal stress. Some simulation packages allow you to simulate these post-processing steps and help evaluate whether a heat treatment is necessary (or even effective).</p><h2>List of simulation software</h2><p><strong>Discretization:</strong> The first step of a good simulation is the correct discretization of the part volume. Unlike regular mechanical simulation, which uses conformal meshing with tetrahedrons, most 3D printing simulation software use voxelization. The 3D volume of the part is represented by small cubes (or voxels), in a similar way that a 2D image in a PC monitor is represented by square pixels. Using more meshing elements produce more precise results, but also increases significantly the simulation time. Finding the right balance is key.</p><p>For an initial simulation, it can be interesting to launch a first coarse simulation, with large voxels, in order to obtain “quick and dirty” results. Such a simulation should enable you to obtain in a matter of seconds or minutes the main deformation areas of your print. It will not cost you much and can help you decide if a more precise simulation (with smaller voxels) is necessary.</p><p><strong>Material & print parameters:</strong> Once the part is discretized, you need to select the material properties. Defining the material properties is probably the most crucial step in the simulation process, as inaccurate data will produce wrong simulations results. Most editors provide their own material library, which can be really helpful to get you started. In both cases, they are probably not perfectly adapted for simulations. Every simulation software allows you to modify or create your own materials to generate the most accurate simulations. This requires expert material science knowledge to be done correctly and it is not recommended for inexperienced users.</p><p><strong>Calibration:</strong> Some simulation software allows you to calibrate the material properties based on test specimens printed in a specific material and on a specific machine. This way, more precise material properties are identified, resulting in more accurate simulation results.</p><h2>Key steps for a successful simulation</h2><p>There are two types of simulation software: cloud based solvers and local solvers. Cloud based solvers are usually faster than local solvers, as they are not restricted by the computational capabilities of your computer. However, some companies are reluctant to use cloud based solvers due to confidentiality issues, as data sent through the Internet could be more easily compromised. For most application this would not be an issue.</p><p><strong>Here is a list of some of the most popular 3D printing simulation software:</strong></p><table><tr><th>Software</th><th>Type</th><th>Supported Processes</th></tr><tr><td>Amphyon</td><td>Local</td><td>SLM/DMLS</td></tr><tr><td>Comsol</td><td>Local</td><td>SLM/DMLS, SLS, FDM</td></tr><tr><td>ESI</td><td>Local</td><td>SLM/DMLS</td></tr><tr><td>exaSIM</td><td>Cloud-based</td><td>SLM/DMLS</td></tr><tr><td>Netfabb</td><td>Local & Cloud-based</td><td>SLM/DMLS</td></tr><tr><td>Simufact</td><td>Local</td><td>SLM/DMLS, EBM</td></tr><tr><td>GeonX</td><td>Local</td><td>SLM/DMLS</td></tr><tr><td>EX Digimat-AM</td><td>Local</td><td>SLS, FDM</td></tr></table><h2>Rules of Thumb</h2><ul><li>Simulate before support generation to improve part geometry and to aid with the design of supports.</li><li>Simulate after support generation to validate accuracy and to check for recoater interference.</li><li>First run a quick simulation with large voxels to identify areas of larger deformation. Then refine the mesh to improve accuracy of the results.</li><li>Simulate temperature without mechanical resolution to save time, as solving the heat accumulation issues might also solve mechanical deformation problems.</li><li>Prefer cloud based simulation software for faster performance, but use local solvers if needed to comply with confidentiality policies.</li></ul>" },
    "18": { "title": "What are the top STL file errors? Here's how to fix them", "content": "<h2>Introduction</h2><p>The STL file format is the most commonly used file type in 3D printing. All modern CAD (Computer Aided Design) software allows you to export their native file format into STL.</p><p>The STL file represents a 3D model by approximating its outer surfaces using multiple triangles. These triangles create a 3D network (mesh) of points, edges, and faces. This mesh defines the internal volume of the model.</p><p>An STL file is 3D printable if each edge is connected to exactly two faces (manifold). This way the 3D model is represented accurately and without any ambiguity.</p><p>In this article, we describe the most common errors encountered while exporting an STL file for 3D printing. A detailed step-by-step article explaining how to correctly convert your 3D models into STL can be found here.</p><h2>What happens if you 3D print a faulty STL?</h2><p>Faulty or poorly exported STL files can lead to unexpected results: missing faces, poor resolution or other geometric inaccuracies. Also, the 3D printing service provider is more likely to decline an order with faulty STL files or increase its price, as manual labor is needed to repair them.</p><h2>Common STL errors</h2><h3>Boundary edges</h3><p>Boundary edges are detected if some edges of the STL file are not connected to only one face. This essentially means that the model has holes and does not represent a closed surface.</p><p>Most modern slicing software is able to process STL files with open boundaries. Nevertheless, it is hard to predict how such a file will be interpreted by the software and it is not guaranteed that the result will be what the designer intended.</p><p>For example, If the open boundary edge is located on a curved surface (for instance, the side of a cylinder), then the slicing software will probably fill the void with a flat surface, altering the original design.</p><p><strong>Severity:</strong> CAD model modification or STL repair required.<br><strong>Our recommendation:</strong> Re-model the areas where the boundary edges were detected in the native CAD software or repair the faulty STL.</p><h3>Intersecting faces</h3><p>Intersecting faces are detected when two surfaces collide with each other. This error is commonly encountered when multiple bodies are occupying the same space.</p><p>Intersecting faces usually lead to failures during slicing, as the software cannot recognize which areas are “inside” the model and which are “outside”.</p><p>It is relatively straightforward to repair such errors. Most dedicated 3D printing file preparation software can repair these errors, but success is not always guaranteed. It is good design practice (and will save you a lot of time and effort later) to combine all bodies into a single solid in the native CAD software before exporting them into STL.</p><p><strong>Severity:</strong> CAD model modification or STL repair required.<br><strong>Our recommendation:</strong> Combine the bodies into a single solid, before exporting them into STL or repair the faulty STL.</p><h3>Non-manifold edges</h3><p>Non-manifold edges are detected when more than two faces are connected to the same edge. There are two instances of this type of error.</p><ul><li>An extra surface may be defined in the interior of the model, essentially splitting it into two.</li><li>More commonly, the same edge may be shared by more than one body.</li></ul><p>This error will rarely lead to any problems during slicing, but it should be avoided as the intentions of the designer are not clear.</p><p>For example, when an edge is shared by more than one body, it is not certain whether the designer wants them to be connected into a single piece or printed as two objects. To avoid this uncertainty, it is good practice to always add some thickness to the thin sections of your 3D models or increase the clearance between the features that you do not wish to be connected (0.3 mm clearance is usually sufficient). For details on the recommended minimum wall thickness, please refer to the design guidelines of the 3D printing process you are using.</p><p><strong>Severity:</strong> CAD model modification recommended.<br><strong>Our recommendation:</strong> Examine the faulty edges and alter your design accordingly, adding thickness or clearance where needed.</p><h3>Over-refined mesh</h3><p>A mesh is “over-refined” when the total number of triangles of the STL mesh is larger than required. This will not lead to any errors during 3D printing, but it will unnecessarily increase the size of the STL file, making it more difficult to handle. Usually, the tiny details that are represented by an over-refined mesh cannot be 3D printed, as they exceed the capabilities of most systems (in terms of accuracy and minimum feature size).</p><p><strong>Severity:</strong> Attention needed.<br><strong>Our recommendation:</strong> Export using the default setting of your software or by following our guidelines here.</p><h2>How to repair your STL files</h2><p>We recommend these two options for repairing your STL files:</p><ul><li><strong>Repair your STL file using a dedicated 3D printing software:</strong> Many software solutions exist dedicated to the preparation of STL files for 3D printing and they can repair most STL errors. Popular (and free) examples include Netfabb (using the Repair command) and Meshmixer (using the Inspector command). For quick repairs, 3D Builder is an easy-to-use software for visualizing and repairing STL files and a free online STL repair tool can be found here.</li><li><strong>Repair the error in the native CAD software before exporting to STL:</strong> In most cases, best results will be achieved when the STL file is correctly designed and exported in the first place and is always the recommended option.</li></ul><p>If you have any issues with repairing your STL files yourself, our experienced 3D printing experts can help you solve them.</p><h2>Rules of Thumb</h2><ul><li>Upload your files and use our DFM tool to detect common STL errors.</li><li>Solve any issues with your models in the native CAD software before exporting them to STL, as this will have the best results.</li><li>If this is not an option, various free tools exist that can repair most STL errors.</li></ul>" },
    "19": { "title": "3D printing STL files: A step-by-step guide", "content": "<h2>Introduction</h2><p>The STL (Standard Triangle Language) is the industry standard file type for 3D Printing. It uses a series of triangles to represent the surfaces of a solid model. All modern CAD (Computer Aided Design) software allow you to export their native file format into STL. The 3D model is then converted into machine language (G-code) through a process called “slicing” and is ready to print.</p><p>This article will teach you the basic steps you need to follow to correctly export your models for 3D printing.</p><h2>Step 1. Understand the STL resolution</h2><p>The STL file format uses a series of linked triangles to recreate the surface geometry of a solid model. When you increase the resolution, more triangles will be used, approximating the surfaces of the 3D model better, but also increasing the size of the STL file.</p><p>If you export in too low of a resolution, the model will have visible triangles on its surface when it is printed. Most of the times this is undesirable, but it can be exploited to create “low-poly” models with a digital look.</p><p>Increasing the resolution above a certain point is also not recommended, as it brings no additional benefit: very fine details cannot be 3D printed, so the size of the file will be unnecessarily increased, making it more difficult to handle and process.</p><h2>Step 2. Choose the right exporting parameters</h2><p>You can change the resolution of your STL files by altering the tolerance in your CAD software. When unsure, selecting the “high” preset is the safest option for generating an STL file that is suitable for 3D printing.</p><p>Each CAD package has a different way of specifying the STL resolution, but most use two main parameters: chord height and angle.</p><p><strong>The chord height</strong> is the maximum distance that your software will allow between the surface of the original 3D model and the surface of the STL file. Using a smaller chord height will help represent more accurately the curvature of a surface.</p><p>The recommended value for the chord height is 1/20th of the 3D printing layer thickness and never below 0.001 mm (1 micron). This will always result in an STL file with ideal accuracy for most 3D printing applications. Exporting in a smaller tolerance will not have any effect in the quality of your print, as most common 3D printers are not able to reproduce such a high level of detail.</p><p><strong>The angular tolerance</strong> limits the angle between the normals of adjacent triangles. The default setting is often 15 degrees. Some software also specify this tolerance as a value between 0 and 1. Unless a higher setting is necessary to achieve smoother surfaces, the default value of 15 degrees (or 0) is recommended.</p><h2>Step 3. Export STL files from your CAD software</h2><p>All CAD software have their own way to export STL files. Use the following table as a quick reference:</p><table><tr><th>Software</th><th>Description</th></tr><tr><td>Solidworks</td><td>File > Save As... Set Save As... file type to STL Options > Resolution > Fine (or Custom) > OK</td></tr><tr><td>3DS Max</td><td>3DS Max Application Menu > Export > StereoLitho (*.STL)</td></tr><tr><td>AutoCAD</td><td>Output > Send panel > Export At the Command prompt, enter export. In the Export Data dialog box, enter a filename. Under Files of Type, select Lithography (*.stl) and click Save. Select one or more solid objects. Note: The XYZ coordinates of all objects must be above zero. The file extension .stl is automatically appended to the file name.</td></tr><tr><td>Fusion 360</td><td>File > 3D Print Under Refinement / Refinement options, select export settings. Output > untick “Send to 3D Print Utility” > OK > Save</td></tr><tr><td>Inventor</td><td>File > Print > 3D Print Preview Save Copy As... (top left of window) > Save</td></tr><tr><td>Onshape</td><td>Right click on [Part Name] on bottom right > Export Under Format, select STL. Specify model units. Select export settings.</td></tr><tr><td>PTC Creo</td><td>File > Save As... > Save a Copy Change Type to Stereolithography (*.stl). Click OK > a new Export STL dialog will open. Under Deviation Control, change export settings.</td></tr><tr><td>Rhino</td><td>File > Save As… In the Save As... box, select Stereolithography [*.stl].</td></tr><tr><td>Sketchup</td><td>Download Sketchup to DXF or STL plugin. Start Sketchup. Tools > Export to DXF or STL</td></tr><tr><td>Solid Edge</td><td>File > Save As... Set Save As... file type to STL. Options > Select export options</td></tr><tr><td>ZBrush</td><td>Use Decimation Master to appropriately reduce the polygon count. Zplugin > 3D Print Hub > Export as STL.</td></tr></table><p>You can learn more about the different types of CAD software for 3D printing in this article of the Knowledge Base.</p><h2>Rules of thumb</h2><ul><li>Export with a 0.001 mm chord height and 15° angular tolerance for best 3D printing results.</li><li>Avoid exporting unnecessarily large STL files.</li><li>Upload your STL files and we will auto-fix small geometry imperfections.</li></ul>" },
    "20": { "title": "Post processing for FDM printed parts", "content": "<h2>Introduction</h2><p>FDM 3D printing is best suited for cost effective prototypes produced with short lead time. Layer lines are generally present on FDM prints making post processing an important step if a smooth surface is required. Some post processing methods can also add strength to prints helping to mitigate the anisotropic behavior of FDM parts.</p><p>This article will discuss the most common FDM post processing methods.</p><h2>Support Removal</h2><p>Support removal is typically the first stage of post-processing for any 3D printing technologies that require support to accurately produce parts. Support can generally be separated into 2 categories; standard and dissolvable. Unlike the other post-processing methods discussed in this article support removal is a mandatory requirement and does not produce an improved surface finish.</p><h3>Standard support removal</h3><h4>Tool kit</h4><p>Needle-nose pliers Dental pick set</p><h4>Process:</h4><p>Support material can generally be removed from the print with little effort, and cleaning of support material in hard to reach places (like holes or hollows) can be achieved with dental picks and needle-nose pliers. Well placed support structures, and proper print orientation, can greatly reduce aesthetic impact of support material on the final print.</p><h4>Pros</h4><p>Does not alter overall geometry of part. Very quick.</p><h4>Cons</h4><p>Does not remove any layer lines, striations, or blemishes on the print surface. If support structures leave behind excess material or marks, the accuracy and appearance of the print is diminished.</p><p>Finish: ★ ☆ ☆ ☆ ☆ Tolerances: ★ ★ ☆ ☆ ☆ Speed: ★ ★ ★ ★ ☆ Suitable for: All FDM thermoplastics</p><h3>Dissolvable support removal</h3><h4>Tool kit</h4><p>Solvent-safe container Solvent Ultrasonic Cleaner (optional)</p><h4>Process:</h4><p>Standard dissolvable support materials are removed from a print by placing the print in a bath of the appropriate solvent until the support material dissolves. The support is typically printed in: HIPS (usually associated with ABS) PVA (usually associated with PLA) HydroFill. Glass storage containers, like a mason jar, make excellent vessels for dissolving with Limonene. For dissolving in water, any non-porous container will work. For HIPS/ABS prints, a bath in a 1:1 ratio of (R)-(+)-limonene and isopropyl alcohol works very well for rapid support removal. Many other support materials, such as PVA (used with PLA) and HydroFill (PLA and ABS), simply dissolve in plain water.</p><p>Pro-tip: Speed up the dissolving time of soluble support material by using an ultrasonic cleaner, and changing the solvent solution once it becomes saturated with dissolved support material. Using a warm (not hot) solvent will also speed up dissolving time if an ultrasonic cleaner is not available.</p><h4>Pros</h4><p>Allows for complex geometries where standard support removal would be impossible. Results in a smooth surface where support structure is in contact the part.</p><h4>Cons</h4><p>Improperly dissolving soluble material in solvents can result in bleaching and warping of the print. Does not remove any layer lines, striations, or blemishes on the print surface. Can result in small divots or holes in the final print if soluble material has leaked onto the object during printing.</p><p>Finish: ★ ★ ★ ☆ ☆ Tolerances: ★ ★ ☆ ☆ ☆ Speed: ★ ★ ★ ★ ☆ Suitable for: All FDM thermoplastics</p><h2>Sanding</h2><h4>Tool kit</h4><p>150, 220, 400, 600, 1000, and 2000 grit sandpaper Tack cloth Toothbrush Soap Face mask</p><h4>Process:</h4><p>After supports are removed or dissolved, sanding can be done to smooth the part and remove any obvious blemishes, such as blobs or support marks. The starting grit of sandpaper depends on the layer height and print quality; for layer heights of 200 microns and lower, or prints without blemishes, sanding can be started with 150 grit. If obvious blemishes are present, or the object was printed at a layer height of 300 microns or higher, start sanding with 100 grit.</p><p>Sanding should proceed up to 2000 grit, following common sanding graduations (one approach is to go from 220 grit to 400 grit, to 600 grit, to 1000 grit and finally 2000 grit). It is recommended to wet sand the print from start to finish, to prevent friction and heat build-up from damaging the part and keep the sandpaper clean. The print should be cleaned with a toothbrush and soapy water, then a tack cloth, between sanding gradations as well to prevent dust buildup and “caking”. FDM parts can be sanded up to 5000 grit to achieve and smooth, shiny finish.</p><p>Pro-tip: Always sand in small circular motions evenly across the surface of the part. It may be tempting to sand perpendicular to print layers, or even parallel to the print layers, but this can cause “trenches” to form the part. If the part discolors, or if there are many small scratches from sanding, a heat gun can be used to gently warm the print and soften the surface enough to “relax” some of the defects.</p><h4>Pros</h4><p>Produces extremely smooth surface finish. Makes additional post-processing (such as painting, polishing, smoothing, and epoxy coating) very simple.</p><h4>Cons</h4><p>Not recommended for prints with 2 or less perimeter shells, as the sanding process can damage the print. Difficult for intricate surfaces, and prints with small details. Can impact overall accuracy of the the print if sanding is done too aggressively and too much material is removed.</p><p>Finish: ★ ★ ★ ★ ☆ Tolerances: ★ ★ ★ ☆ ☆ Speed: ★ ★ ☆ ☆ ☆ Suitable for: All FDM thermoplastics</p><h2>Cold welding</h2><h4>Tool kit</h4><p>Acetone Foam applicator</p><h4>Process:</h4><p>When the size of a print exceeds the maximum volume of the printer, the design is often broken down into smaller sections and assembled together after printing. For PLA and other materials, assembly can be done using Bond-O or an appropriate glue (glue selection will depend upon plastic). For ABS, multi-part assemblies can be “welded” together using acetone. The mating surfaces need to be brushed lightly with acetone, and firmly held together, or clamped if possible, until the majority of the acetone evaporates. At this point, the two parts are chemically bonded to one another.</p><p>Pro-tip: Increasing the surface area the acetone contacts will increase the strength of the joint. This can be done by incorporating interlocking joints into the design.</p><h4>Pros</h4><p>Acetone will not alter the surface color of the print as much as other glues Once dried, the joint will exhibit the properties of ABS, making further finishing simpler and uniform.</p><h4>Cons</h4><p>The joint formed by “welding” ABS pieces together with acetone is not as strong as a single piece print. Excess use of acetone can aggressively dissolve the part, and negatively impact the resulting finish and tolerances.</p><p>Finish: ★ ★ ☆ ☆ ☆ Tolerances: ★ ★ ☆ ☆ ☆ Speed: ★ ★ ★ ★ ★ Suitable for: ABS</p><h2>Gap filling</h2><h4>Tool kit</h4><p>Epoxy resin (only for small voids) Autobody filler (for large voids and joining) ABS filament & acetone (only for small voids and ABS prints)</p><h4>Process:</h4><p>After sanding a print, or dissolving soluble supports, it is not uncommon for gaps to emerge on the print. During printing, gaps are formed when layers are incomplete due to toolpath constraints and are often inevitable. Small gaps and voids can easily be filled with epoxy (like XTC-3D), and may not require additional processing. Large gaps, or hollows left from joining a multi-print assembly, can be successfully filled with autobody filler which will require additional sanding once dry. Autobody filler makes an excellent filler, and can easily be sanded and painted once fully cured. It is also very strong, and will not weaken the plastic in the surrounding area; conversely, pieces joined with auto body filler or filled voids tend to be stronger than the native plastic.</p><p>Gaps in an ABS print can also be filled by creating a slurry of ABS filament and acetone, which chemically reacts with the ABS print and seeps into any voids in the surface. A ratio of 1 part ABS to 2 parts acetone is recommended, and will not significantly impact the surface finish around the gap if applied properly.</p><p>Pro-tip: If gaps are apparent in the print before sanding, fill the spaces with Bond-O or epoxy then sand once dry. This will greatly reduce the total amount of time required to achieve a smooth surface.</p><h4>Pros</h4><p>Epoxies are easily sanded and primed, making an excellent painting surface. An ABS slurry will be the same color as the print as long as the same filament is used, so there will be no surface discolorations.</p><h4>Cons</h4><p>Autobody filler, or other polyester epoxy, will dry opaquely, resulting in discolored patches on the print. Requires additional sanding to achieve a uniform finish. Can impact overall accuracy of the the print if sanding is done too aggressively and too much material is removed.</p><p>Finish: ★ ★ ☆ ☆ ☆ Tolerances: ★ ★ ★ ☆ ☆ Speed: ★ ★ ★ ☆ ☆ Suitable for: All FDM thermoplastics</p><h2>Polishing</h2><h4>Tool kit</h4><p>Plastic polishing compound 2000 grit sandpaper Tack cloth Toothbrush Buffing wheel or microfiber cloth</p><h4>Process:</h4><p>After sanding a print, a plastic polish can be applied to give standard thermoplastics, like ABS and PLA, a mirror-like surface finish. Once the print is sanded up to 2000-grit, wipe excess dust off the print with a tack cloth then clean the print in warm water bath with a toothbrush. Allow the print to dry fully, and buff using a buffing wheel or by hand with a microfibre cloth and plastic polishing compound, such as Blue Rouge. Blue Rogue is a type of jeweller’s polish, designed specifically for plastic and synthetics and produces a long-lasting surface shine. Other plastic polishes, such as those for vehicle headlights, work as well but some may include chemicals that can damage the print material.</p><p>Pro-tip: Attach a buffing wheel to a variable speed Dremel (or another rotary tool, like a power drill) for polishing small prints. A bench grinder fitted with a buffing wheel can be used for larger more robust prints, but ensure the print does not stay in one place for too long. This can cause the plastic to melt, due to friction.</p><h4>Pros</h4><p>Polishes the print without the use of any solvents that can warp the print and alter tolerances. Produces a mirror-like finish if properly sanded and polished, which mimics injection molded plastics. Plastic polish and cleaner is highly economical making this method very cost effective for the quality of the finish.</p><h4>Cons</h4><p>Print must be sanded thoroughly before polishing if a mirror-like finish is desired, which can impact tolerances. Primer/paint may not adhere to the surface after polishing.</p><p>Finish: ★ ★ ★ ★ ★ Tolerances: ★ ★ ★ ☆ ☆ Speed: ★ ★ ☆ ☆ ☆ Suitable for: All FDM thermoplastics</p><h2>Priming & painting</h2><h4>Tool kit</h4><p>Tack cloth Toothbrush 150, 220, 400 and 600 grit sandpaper Aerosol plastic primer Topcoat paint Buffing sticks Polishing paper Masking tape (only if multiple colors are to be used) Nitrile gloves & appropriate mask</p><h4>Process:</h4><p>Once the print is properly sanded (only need to go up to 600 grit for painting), the print can be primed. Priming should be done in two coats, using an aerosol primer. An aerosol primer designed for model painting will provide even coverage, and be thin enough to ensure details of the print are not obscured before painting begins. Thick primer, such as what can be purchased at a hardware store, may clump and require significant sanding. Spray the first coat in short quick strokes, approximately 15 - 20 cm away from the part, to avoid pooling of the primer. Allow the primer to dry, and sand any imperfections with 600 grit sandpaper. Apply the final coat of primer in light quick strokes, again being very careful to prevent pooling.</p><p>Once priming is complete, painting can begin. Painting can be done with artist acrylic paints and brushes, but the use of an airbrush or aerosol can will provide a smoother surface finish. Spray paint from a hardware store is thicker in viscosity, and more difficult to control, so paints designed specifically for model painting should be used. The primed surface should be buffed and polished (buffing and polishing sticks used by nail salons can be purchased online, and work perfectly for this application) then cleaned using a tack cloth. Paint the model using very light coats; the first few layers will look translucent. Once the paint forms an opaque layer (generally after 2-4 layers), allow the model to sit for 30 minutes so the paint can set. Gently polish the paint layer with the nail sticks, and follow this process for each desired color (polishing between every layer of paint).</p><p>Sections of the model can be masked with painter’s tape to preserve the undercoat color if desired. Once all paint layers are complete, remove the masks and polish the paint using polishing paper. Polishing paper, such as 3M’s or Zona’s, can be purchased in different grits and is a relatively new product. It can be purchased as a pack from many online retailers and gives paint, as well as top-coats, a shine that can otherwise not be easily achieved. Apply 1-2 layers of a topcoat to protect the paint, and allow to dry fully. The topcoat should be chosen in accordance with the recommendations of the manufacturer of the paint used. Incompatible topcoat and paint layers can ruin the paint job, so it is very important compatibility is assured here.</p><p>Pro-tip: When using aerosol paint, do not shake the can! The goal is to mix the pigment or primer without shaking up the propellant, which will result in bubbles in the spray. Instead, swirl the can for 2-3 minutes; the mixing bead should roll like a marble instead of rattling.</p><h4>Pros</h4><p>Produces professional results with attention to detail and some practice. Allows for complete flexibility of the visual appearance of the final product, independent of the material/color the object was originally printed in.</p><h4>Cons</h4><p>Paint and primer add bulk to the model, which will alter tolerances and can cause issues if the piece is part of an assembly. Acquiring high quality aerosol paint or an airbrush can increase cost.</p><p>Finish: ★ ★ ★ ★ ★ Tolerances: ★ ★ ★ ☆ ☆ Speed: ★ ☆ ☆ ☆ ☆ Suitable for: All FDM thermoplastics</p><h2>Vapor smoothing</h2><h4>Tool kit</h4><p>Tack cloth Solvent-safe sealable container Solvent Paper towels Aluminum foil (or other solvent-proof material) Face mask & chemical-resistant gloves</p><h4>Process:</h4><p>Line the chosen container with paper towels along the bottom, and up the sidewalls if possible. It is critical that the vapor will not compromise the chamber itself, and the chamber can be sealed. Glass and metal containers are recommended. Pour in enough solvent to dampen, but not soak, the paper towels; this should also help the towels adhere to the sidewalls of the container. Acetone is well-known for its abilities to smooth ABS. For PLA, smoothing is possible with different solvents (THF or MEK work decently) but it is generally more difficult to get a smoothed surface when compared to ABS. When working with any solvent, please check the safety regulations on the chemical and always use appropriate safety precautions. A small “raft” of aluminum foil, or other solvent-proof material, should be placed in the middle of the paper towel lined container. Place the print on the raft (with whatever side has been chosen as the bottom resting on the raft), and close the lid of the container. Vapor polishing will take a variable amount of time, so check the print periodically. Heat can be used to increase the speed the polishing occurs at, but care must be taken to prevent the buildup of potentially explosive vapor.</p><p>When removing the print from the chamber, try to avoid touching the print at all by leaving the print on the raft, and removing both from the container. Any points where the print has been contacted will have surface imperfections, as the outer shell will be semi-dissolved. Allow the print to fully off-gas any remaining solvent before handling.</p><p>NOTE: Many aerosolized and/or atomized solvents are flammable/explosive, and solvent vapor can be harmful to human health. Take extreme care if heating solvents, and always smooth prints/store solvent in a well-ventilated space.</p><h4>Pros</h4><p>Smooths many small blemishes and diminishes the layer lines present in a print without any additional work. Produces a very smooth “shell” around the exterior of the print. Very quick, and can be done with commonly sourced materials.</p><h4>Cons</h4><p>Will not “heal” gaps or fully mask layer height. Smoothing process “dissolves” the outer shell of the print and therefore this has a heavy impact on tolerances. Negatively impacts the strength of the print due to alterations in the properties of the print material.</p><p>Finish: ★ ★ ★ ★ ☆ Tolerances: ★ ★ ☆ ☆ ☆ Speed: ★ ★ ★ ☆ ☆ Suitable for: ABS (sometimes PLA)</p><h2>Dipping</h2><h4>Tool kit</h4><p>Solvent-safe container Solvent Eye hook or small screw Heavy gauge sculpting or landscaping wire Drying rod or rack Face mask & chemical-resistant gloves</p><h4>Process:</h4><p>Ensure that the container to be used is wide enough and deep enough to accommodate the print and the solvent. Fill the container with an appropriate amount of solvent, being careful to minimize any splashing. As with vapor smoothing, acetone should be used for dipping ABS, and MEK or THF can be used to dip PLA. PLA is fairly resistant to solvent smoothing so it may take several attempts to achieve the desired result. Prepare the print for dipping by screwing an eye hook or small screw into an inconspicuous surface of the print. Loop the wire through the eye of the hook, or around the screw, so that the print can be lowered into the bath using the wire. If the wire is too thin of a gauge, it will not be able to counteract the buoyancy of the print and make proper dipping very difficult.</p><p>Once the print is prepped, quickly submerge the entire object in the solvent for no more than a few seconds using the wire. Remove the print and hook the wire over a drying rod or rack to allow the solvent to fully evaporate from the surface. The print can be gently shaken after removal to facilitate drying, and ensure no solvent pools in recesses on the surface.</p><p>Pro-tip: If once dry, the print has an opaque white-ish color, it can be suspended over the solvent bath for some time to allow the evaporating solvent vapor to slightly dissolve the surface. This will restore the print’s color and ensure a shiny outer layer.</p><h4>Pros</h4><p>Smooths the print surface much quicker than vapor polishing. Produces much less vapor than other methods of solvent polishing, which reduces the safety risks.</p><h4>Cons</h4><p>Very aggressively smooths the surface of the print, so tolerances will not be maintained. Too long of a dip can result in complete deformation of the print, and significant alteration to the material properties.</p><p>Finish: ★ ★ ★ ★ ☆ Tolerances: ★ ☆ ☆ ☆ ☆ Speed: ★ ★ ★ ★ ☆ Suitable for: ABS (sometimes PLA)</p><h2>Epoxy coating</h2><h4>Tool kit</h4><p>2-part epoxy resin (such as XTC-3D) Foam brush applicator Mixing container 1000 grit or higher sandpaper</p><h4>Process:</h4><p>Once the print is sanded (sanding first will produce better final results), fully clean the print with a tack cloth. Mix the appropriate ratio of resin to hardener as specified on the instructions for the resin, ensuring everything is measured precisely. Epoxy resins are exothermic when mixed, so glass containers and containers composed of materials with low melting points should be avoided. Containers specifically designed for mixing epoxy resins are recommended. Improper ratios will increase drying time, and the epoxy may never fully cure, resulting in a “tacky” finish. XTC-3D is a specialized coating designed for 3D printing, but any 2-part epoxy resin will work well for this application as long as it is prepared properly. Thoroughly mix the resin and the hardener as per the instructions using smooth revolutions, to minimize the number of air bubbles introduced to the system. A little epoxy goes a long way, and most epoxies only have a working time of 10-15 minutes so plan accordingly.</p><p>Apply the first coat of the epoxy using a foam applicator, and try to minimize pooling on any recessed surfaces or details of the print. Once the print has been sufficiently coated, allow the epoxy to fully cure as per manufacturer instructions. A first coat may be sufficient to smooth the print, but for an optimal finish, the print should be lightly sanded with fine sandpaper (1000 grit or higher) to remove any imperfections. Remove any dust with a tack cloth, and apply a second coat of epoxy, following the same procedure.</p><h4>Pros</h4><p>Very thin layer of epoxy will not impact the tolerances of the print all that greatly (unless the print is sanded first). Provides an outer protective “shell” around the print.</p><h4>Cons</h4><p>Surface layer lines will still be visible, they are just under a “smooth” shell. Applying too much epoxy can result in pooling in details of the print and edges, giving the surface a “dripping” look.</p><p>Finish: ★ ★ ★ ★ ☆ Tolerances: ★ ☆ ☆ ☆ ☆ Speed: ★ ★ ★ ★ ☆ Suitable for: All FDM thermoplastics</p><h2>Metal plating</h2><h4>Tool kit (for home plating)</h4><p>Electroforming solution Sacrificial anode Conductive paint or acetone & graphite Power rectifier Conductive screw or eye-hook Non-conductive vessel Lead set Non-conductive gloves and protective eyewear</p><h4>Process:</h4><p>Metal-plating can be done using electroplating at home, or a professional shop. Proper metal-plating requires a strong knowledge of materials, and what can be done at home is limited in comparison to what a professional shop can achieve. For superior finishes, and a wider range of plating options including chroming, utilizing a professional shop is the best option. For clarity, the process of electroplating with copper will be described below.</p><p>Electroplating at home can be done using copper or nickel as a base plate, to which other metals can then be plated over. It is of critical importance that the print surface is as smooth as possible prior to plating; any irregularities and layer lines will be emphasized after the plating process. Prepare the cleaned and sanded print for plating by coating the plastic with a thin layer of high-quality conductive paint, or a solution of acetone and graphite if the print is ABS. Allow the conductive coating to dry fully, and sand if necessary to ensure a smooth surface. It is of utmost importance to minimize contact with the print at this point or wear gloves, as the oils from skin will affect the plating process.</p><p>Insert the screw or eyehook into an inconspicuous surface of the print, and attach to one of the rectifier leads; this will serve as the cathode and must be connected to the negative terminal of the rectifier. Attach the copper anode to the positive terminal of the rectifier using the second power lead, and fill the chosen vessel with enough copper electroforming solution to fully cover the print and copper anode. Insert the anode into the bath and turn on the power rectifier. Once the rectifier is on, insert the print into the bath, ensuring it is not contacting the anode at any point (Be very careful at this step, as once the print is in the bath, the plating system is electrically live and any contact with the solution or anode/cathode can cause injury). Set the power rectifier to 1-3 volts, and allow plating to occur until the print is fully coated. The voltage can be increased to increase plating time, but do not exceed 5 volts. Simply power off the rectifier and remove the print once a satisfactory coating has been deposited and dry the print using microfiber towels. Coat the print with a metal lacquer once dry to protect from corrosion.</p><h4>Pros</h4><p>A plated metal shell increases the strength of the plastic part, which greatly broadens potential applications and uses of the print. The outer metal coating is very thin, so tolerances can be tightly held if the plating is done properly. Produces a beautiful surface finish, which if done properly, will not look like a 3D printed object.</p><h4>Cons</h4><p>Generally, very expensive to plate the prints professionally, and electro-plating at home requires a decent amount of equipment for a professional finish. Electroplating at home can cause electrical injury if proper safety procedures are not followed and adhered to.</p><p>Finish: ★ ★ ★ ★ ☆ Tolerances: ★ ★ ★ ☆ ☆ Speed: ★ ★ ★ ★ ☆ Suitable for: All FDM thermoplastics</p>" },
    "21": { "title": "Post processing for SLA printed parts", "content": "<h2>Introduction</h2><p>SLA 3D printing is capable of producing prints with fine details and feature as small as 0.3 mm. The biggest drawback to this technology is that parts are often small and most prints need to be oriented at an angle and require support structures to be attached to the model. These supports leave marks on the surface and create uneven surfaces. Fortunately, most SLA resins are one of the easiest 3D printed materials to post process. SLA resins allow for a range of finishing options with the most common of these described in this article.</p><h2>Basic support removal</h2><h4>Process:</h4><p>The support structure is broken off or cut from the model leaving a bumpy surface on the surfaces in contact with support material. If a high quality surface finish is required adding extra material (at least 0.1 mm) to be sanded afterwards allows for better dimensional accuracy.</p><h4>Pros</h4><p>Gives the customer complete control over the finish. For critical vertical hole diameters drilling after printing is recommended if high accuracy is desirable. Highest accuracy as overall geometry is not altered.</p><h4>Cons</h4><p>Not aesthetically pleasing High level of skill required to achieve a clean finish.</p><p>Finish: ☆ ☆ ☆ ☆ ☆ Tolerances: ★ ★ ★ ☆ ☆ Speed: ★ ★ ★ ★ ★ Suitable for: All SLA resins</p><h2>Sanded support nibs</h2><h4>Process:</h4><p>Only the small support nibs are sanded off. This process is suited for flat surfaces where it is easy to judge the surface is flat. Because the surface is only sanded at the support nibs the overall geometry of the parts is generally unaffected.</p><h4>Pros</h4><p>Accurate surface (gives geometry that is close to the 3D model) Resulting matte finish hides imperfections.</p><h4>Cons</h4><p>Can result in uneven surfaces on side where support was located (due to non-uniform sanding) Not aesthetically appealing (particularly on clear resin).</p><p>Finish: ★ ☆ ☆ ☆ ☆ Tolerances: ★ ★ ★ ★ ☆ Speed: ★ ★ ★ ★ ☆ Suitable for: All SLA resins</p><h2>Wet sanded</h2><h4>Process:</h4><p>Wet sanding generally achieves the smoothest surface finish (depending on the number of sandpaper graduations used). On the unsupported side of the model, only the build lines need to be sanded. This can typically be achieved with a single high grade of sandpaper (no graduation needed) making the finish a lot cheaper. The supported side is more labor intensive typically requiring at least 4 sandpaper graduations. It is, therefore, best practice to place the supports on the least visible part of the model. Depending on the support placement there may be some accuracy loss as material is removed through the sanding process.</p><h4>Pros</h4><p>Excellent smooth finish Ideal for complex geometries Best surface preparation for painting.</p><h4>Cons</h4><p>Lower accuracy on supported side Water used while sanding can result in some white/light spots on the print.</p><p>Finish: ★ ★ ★ ☆ ☆ Tolerances: ★ ★ ★ ☆ ☆ Speed: ★ ★ ★ ☆ ☆ Suitable for: All SLA resins</p><h2>Mineral oil finish</h2><h4>Process:</h4><p>This finish is similar to the wet sanded finish with the exception of a mineral oil layer added after the sanding process. The mineral oil helps to hide the white/light spots on the model creating a nice even finish.</p><p>This finish is well suited for mechanical parts reducing friction and lubricating the surface.</p><h4>Pros</h4><p>Results in a semi transparent finish for clear resins.</p><h4>Cons</h4><p>Paint does not adhere well to surface.</p><p>Finish: ★ ★ ★ ☆ ☆ Tolerances: ★ ★ ★ ☆ ☆ Speed: ★ ★ ★ ☆ ☆ Suitable for: All SLA resins</p><h2>Spray paint (clear UV protective acrylic)</h2><h4>Process:</h4><p>Spray painting the model helps to conceal layer lines reducing the need to sand the unsupported side of the model. The varnish also protects the model from yellowing and post curing by limiting UV exposure.</p><p>Acrylic paint will not adhere well to flexible resin. If flexible resin needs to have a glossy finish coating with a thin layer of resin then curing underwater can achieve this, however, this affects tolerances and details dramatically.</p><h4>Pros</h4><p>Clear finish on complex geometries for clear resin Offers UV protection.</p><h4>Cons</h4><p>Typically results in an ‘orange peel’ effect on the surface Increases overall dimensions Not suited for sliding or moving parts.</p><p>Finish: ★ ★ ★ ★ ☆ Tolerances: ★ ★ ☆ ☆ ☆ Speed: ★ ★ ☆ ☆ ☆ Suitable for: All SLA resins</p><h2>Polished to clear transparent finish</h2><h4>Process:</h4><p>The surface is sanded using increased grit levels of sand paper (concluding with 2000 grit). The surface is then polished with a polishing compound. This results in the most clear surface possible but it is very time consuming and only possible on surfaces that can be sanded easily.</p><p>This finish is well suited for simple shapes with few details (like the crystal of a watch). It is less suited for models which need a clear finish on both sides with complex geometries like ribs and small spaces.</p><p>This finish may not be suitable for tough and flexible resin as they are softer than the other resins.</p><h4>Pros</h4><p>Clear finish (comparable to glass) Very smooth surface.</p><h4>Cons</h4><p>Labour intensive Not possible with complex geometries.</p><p>Finish: ★ ★ ★ ★ ★ Tolerances: ★ ★ ☆ ☆ ☆ Speed: ★ ☆ ☆ ☆ ☆ Suitable for: Clear resin. Can be used on engineering and coloured resins but typically not necessary</p>" },
    "22": { "title": "Post-processing for SLS and MJF 3D printed parts", "content": "<h2>Introduction</h2><p>Selective laser sintering (SLS) and Multi Jet Fusion (MJF) are exciting and robust 3D printing technologies capable of manufacturing accurately detailed and complex parts without the need for support material. In general, parts produced via SLS and MJF are fit for end-use, though applying a post-process to your parts can elevate their overall quality in many respects.</p><p>There is a wide range of post-processing techniques and finishes available for SLS and MJF 3D printed parts. Manufacturers often add coatings to SLS parts in particular to improve their performance. As well, adding a functional coating can sometimes help to compensate for the lack of feasible material grades available to SLS and MJF.</p><h2>How do you dye SLS and MJF parts?</h2><p>The fastest and most cost-efficient method to add color to SLS and MJF parts is by dyeing them. SLS and MJF parts are porous, which makes them ideal for dyeing.</p><p>To dye a part, immerse it in a hot color bath - a large range of colors is available for SLS parts, with more color options on the way for MJF. Using a color bath ensures that you cover all internal and external surfaces of the part. Typically, the dye only penetrates the surface down to a depth of around 0.5 mm, which means that over time the color will fade and expose the original color of the powder. So, watch for wear and tear.</p><h4>Pros</h4><ul><li>A large range of colors available for SLS</li><li>Dyeing doesn’t affect part dimensions</li><li>Multiple parts can be dyed at once</li><li>More cost-efficient than other coloring methods</li><li>Ideal for complex geometries</li></ul><h4>Cons</h4><ul><li>Dye only gets 0.5 mm into the part’s surface</li><li>Doesn’t result in a glossy finish</li></ul><h2>How does chemical vapor smoothing work?</h2><p>Chemical vapor smoothing enhances part performance and aesthetics. This seals surfaces, making it easier to dye and certify for contact with skin and food while maintaining dimensional accuracy. Chemical vapor smoothing isn’t restricted by line-of-sight only, unlike other post-processing methods. As well, you don’t end up with any fixture marks.</p><p>It’s important to note that while chemical vapor smoothing re-distributes surface material to provide a sealed, smoothed surface, it doesn’t create a polished surface. Your part’s surface topology will still be visible, as well as its minimal layer lines.</p><h4>Pros</h4><ul><li>Creates a smooth surface finish</li><li>Able to smooth out complex geometries, even if not in a direct line of sight</li><li>More resistant to dirt</li></ul><h4>Cons</h4><ul><li>Softens sharp edges and corners</li><li>Not suitable for small features</li><li>Not suitable for thin walls</li><li>Not suitable for living hinges or lever features</li></ul><h2>How do vibro polishing and tumbling affect SLS and MJF parts?</h2><p>As SLS and MJF parts are printed using nylon powder, completed parts will have a coarse surface finish. Vibro polishing smoothes out the surface of the part via a tumbler filled with small media (generally ceramic beads) that vibrate against the surface of the model, removing the grainy texture. This method gives your part a smooth and slightly shiny appearance, similar to injection molded parts.</p><p>It’s important to note that vibro polishing and tumbling affect the part dimensions and round out otherwise sharp edges. We don’t recommend using a tumbler for parts with fine details and intricate features. Smaller, weaker parts are likely to be damaged after being exposed to vibrating media for several hours. As well, small ceramic beads may get stuck inside medium-sized gaps and trenches.</p><h4>Pros</h4><ul><li>Creates smooth surface finishes</li><li>Capacity for multiple parts at the same time</li><li>Awesome aesthetics</li><li>More resistant to dirt</li></ul><h4>Cons</h4><ul><li>Not suitable for small features</li><li>Not suitable for thin walls</li><li>Affects part tolerances</li><li>Tumbling media can get stuck in crevices and gaps</li><li>Removing sharp edges can negatively impact part geometry</li></ul><h2>What is the standard finish for SLS parts?</h2><p>The standard finish is your default for SLS printed parts. With this process, you remove parts from the build chamber and use compressed air to get rid of all the excess powder material. After this, you clean the surface via plastic bead blasting to remove any unsintered powder that may still stick to the surface.</p><p>This standard finish is inherently rough, similar in feel to medium grit sandpaper (satin-like matte that’s slightly grainy). However, it’s the best surface preparation for painting or lacquering your parts.</p><p>All SLS parts come with this standard finish unless otherwise specified.</p><h4>Pros</h4><ul><li>Good accuracy as overall geometry is unaltered</li><li>More cost-efficient</li></ul><h4>Cons</h4><ul><li>Matte, grainy surface finish</li><li>Limited color options based on powder color (typically white)</li></ul><h2>Are spray painting and lacquering viable options for SLS and MJF?</h2><p>Other options for SLS and MJF parts include spray painting and lacquering. For both types of parts, you can spray paint them or coat them with lacquer (varnish or clear coat). Via lacquering, it’s possible to obtain various finishes such as high gloss or metallic sheen. Lacquer coatings can improve your part’s resistance to wear and tear, surface hardness and water tightness while limiting marks and smudges on its surface.</p><p>Due to the porous nature of SLS and MJF parts, we recommend that you apply four to five very thin coats to get a final finish, rather than relying on a single coat. An added benefit to this is that the finish will dry faster and reduce the likelihood of the paint or lacquer running.</p><h2>Can you use metal coating on SLS and MJF parts?</h2><p>Both SLS and MJF parts can be electroplated. Stainless steel, copper, nickel, gold and chrome (and several combinations of these metals) can be deposited on the surface of parts to increase tensile strength and electrical conductivity in shielding applications.</p><h4>Pros</h4><ul><li>Improves part strength and functionality</li><li>Changes the aesthetic so parts look metallic</li><li>Parts become conductive</li></ul><h4>Cons</h4><ul><li>Increases lead times</li><li>Significantly increases cost</li><li>Limited variety of metals available</li></ul><h2>How does media/bead blasting work for SLS and MJF?</h2><p>Bead blasting uses rounded spherical media that impact the surface of the part, leaving a more uniform finish caused by the sphere “dimpling” the surface. This process is most often used when manufacturers require a smooth, uniform finish or a dull “satin” finish.</p><p>Bead blasting involves using a spray gun to shoot fine media in a bead or sphere to smoothen 3D printed objects.</p><h4>Pros</h4><ul><li>Creates a smooth surface finish</li><li>Strong aesthetic appearance</li><li>More resistant to dirt</li></ul><h4>Cons</h4><ul><li>Softens sharp edges and corners</li><li>Not suitable for small features</li><li>Not suitable for thin walls</li><li>Blasting media can get stuck in crevices and gaps in the part</li></ul>" }    

}


